{"docstore/data":{"6d50c30c-c1b4-4361-8afa-e9f82cf12341":{"indexId":"6d50c30c-c1b4-4361-8afa-e9f82cf12341","nodesDict":{"9603aaa8-6f00-4921-a856-ca64212449cf":{"id_":"9603aaa8-6f00-4921-a856-ca64212449cf","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"NEXT":{"nodeId":"b49f31bb-cdd5-4ca5-ba59-166ee51df6fd","metadata":{},"hash":"JSMXePW75p2fA/SbTZHN6gWA9FtDNmBRhftWQussLQI="}},"hash":"N8DLzifVIB/QrnuFRZ1O7qdd3+REymE8f/yJVCmYygg=","text":"The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 1 of 38\nThese Rules & Regulations were approved by the 17\nth \nSyndicate of the\nUniversity of Haripur, held on 12 Sep. 2019 and shall be effective w.e.f Semester\nFall 2019. 1. SHORT TITLE, COMMENCEMENT AND APPLICATION\n1.1. These Rules and Regulations shall be known as \"The University of Haripur\nSemester Rules & Regulations (Revised) 2018 for regular students\". These\nRules & Regulations are framed under Sections 29 and 31 of the Khyber\nPakhtunkhwa Universities Act, 2012 (as amended vide Khyber Pakhtunkhwa\nUniversities Amended Act, 2016. 1.2. These Rules and Regulations shall come into force with immediate effect and\nthese shall apply to all the students registered in the University of Haripur, whether\nthey are studying in the University or in its constituent colleges/ affiliated\ninstitutions/ sub-campus(s) in BS (4-Years) and M.A/M.Sc (2-Years) and other\nequivalent/similar semester based undergraduate degree programs. …………………………………………………………………………\n2. DEFINITIONS\n2.1. Academic Program: A \"Program of Studies\", which leads to the award of a\nuniversity degree to a student, after the successful completion of all the\nprescribed requirements. 2.2. Admission: Admission of a student as a regular student of the University of\nHaripur or in its constituent/affiliated college/institute/Sub-Campus(s). 2.2A. Dual Admission: Simultaneous admissions in more than one programs of\nstudies. Such cases shall be dealt as per HEC Policy in vogue. 2.3. Admission Committee: A departmental committee notified for the purpose of\nadmissions of the students who qualify the prescribed eligibility criteria for\nadmission in a particular program. 2.4. Assessment: The assessment of the performance or achievement of the\nstudents in an academic program.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"b49f31bb-cdd5-4ca5-ba59-166ee51df6fd":{"id_":"b49f31bb-cdd5-4ca5-ba59-166ee51df6fd","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"9603aaa8-6f00-4921-a856-ca64212449cf","metadata":{},"hash":"N8DLzifVIB/QrnuFRZ1O7qdd3+REymE8f/yJVCmYygg="},"NEXT":{"nodeId":"6e310bdd-462f-40c6-806c-e4bcc2a787fe","metadata":{},"hash":"DqH1YTo6xhQLlyDRH2KXCcXOvf8JDssnCrTRQ3i7nwo="}},"hash":"JSMXePW75p2fA/SbTZHN6gWA9FtDNmBRhftWQussLQI=","text":"Assessment: The assessment of the performance or achievement of the\nstudents in an academic program. This can include assessment methods such\nas assignments, examinations, practical (Lab) work/field work project work,\nseminar papers, and tutorial participation etc. as per HEC relevant policy (as\namended from time to time). 2.5. Assignment: A task relevant to a course of study assigned to the student by\nconcerned faculty member to substantiate the course contents. The\nassignment may or may not be graded. 2.6. Associate Degree Program: A four-semester (two-year) undergraduate\nregular study program (offered as per HEC/HED Policy in vogue). 2.7. Cease: A student is considered unsuitable for further studies at The University\nof Haripur as a regular student for a specified time on disciplinary grounds by\nuniversity authorities, as defined in The University of Haripur Discipline Rules. 2.8. Chairperson/ Head: Chairperson/Head of an academic department. 2.9. Contact Hour: One contact hour means 60 minutes of teacher – student\ninteraction (with 05minutes break inclusive) spent on academic/research related\nactivities including instructional work/tutorials, research work, projects,\nseminars, workshops etc. during the course of studies at the university. 2.10. Controller: The Controller of Examinations of the University of Haripur. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 2 of 38\n2.11. Course: A set of contents related to an academic Program, which is to be\nstudied by a student for a fixed number of hours during a semester. Each\nsubject will carry a specific discipline code and number. 2.12. Credit Course: A “Credit Course” means a course of study, successful\ncompletion of which shall be a requirement for the degree. 2.13. Credit Hour (Cr. Hr): credit hour in class means teaching/earning a theory\ncourse for one hour each week throughout the semester. One credit hour in\nlaboratory or practical work/project would require lab contact of three hours per\nweek.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"6e310bdd-462f-40c6-806c-e4bcc2a787fe":{"id_":"6e310bdd-462f-40c6-806c-e4bcc2a787fe","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"b49f31bb-cdd5-4ca5-ba59-166ee51df6fd","metadata":{},"hash":"JSMXePW75p2fA/SbTZHN6gWA9FtDNmBRhftWQussLQI="},"NEXT":{"nodeId":"d3e120c4-0c60-4c69-a350-75e2066c85a0","metadata":{},"hash":"afF9QJt0pEHY9P3Y9V14BQyvzZgdh1bWAEyTUn02uFM="}},"hash":"DqH1YTo6xhQLlyDRH2KXCcXOvf8JDssnCrTRQ3i7nwo=","text":"2.14. Cumulative Grade Point Average (CGPA): The summation of grade points of\nall credit courses divided by the total number of credit hours taken by a student. 2.15. Dean: The Dean of a faculty. 2.16. Department: An Academic Department of the University of Haripur. 2.17. Drop out: A student considered unsuitable upon academic performance for\nfurther studies at The University of Haripur or its constituent Institute/ Affiliated\nCollege/Sub-campus and is removed from the roll of the University. 2.18. Examiner: A person appointed to conduct the examination. 2.19. Faculty: A faculty of the University of Haripur. 2.20. Grade: A mark (letter grade or number) indicating the assessment of student‟s\nacademic performance. 2.21. Grade Point (P): Number of points representing the letter grades scored by a\nstudent in a course. 2.22. Grade Points of a Credit Course: Total number of points scored by student in\na credit course. This number is the product of points representing the letter\ngrade scored by the student in a course and the number of credit hours taken of\nthe course. 2.23. Grade Point Average (GPA): The average of the accumulative grade point\nearned in a semester or in the whole course of study. 2.24. Internship: Students' engagement in a relevant academic, research or\nbusiness organization related to the discipline chosen for specialization of\nmaximum of 3 credit hours offered in any upper division semester as per\nrequirement of discipline. 2.25. Make-Up Test/Exam: A Terminal test/exam for the students who could not\nappear for any genuine reason or due to attending sports/national/international\nevent on behalf of the University. 2.26. Non-Credit Course: A course of study, successful completion of which is\nrequired for a degree/diploma but not counted towards CGPA. 2.27. Practical/Laboratory (Lab) Test: These tests include all such\nexaminations/assessment to ascertain the level of competence of practical\napplication of knowledge acquired. 2.28.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d3e120c4-0c60-4c69-a350-75e2066c85a0":{"id_":"d3e120c4-0c60-4c69-a350-75e2066c85a0","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"6e310bdd-462f-40c6-806c-e4bcc2a787fe","metadata":{},"hash":"DqH1YTo6xhQLlyDRH2KXCcXOvf8JDssnCrTRQ3i7nwo="},"NEXT":{"nodeId":"48ee9063-b39c-4e09-bb08-5624bc618769","metadata":{},"hash":"UWN/LaNSCYiU/GDlSTc4G5lr04kGhhf5K7RIOq88Z9Q="}},"hash":"afF9QJt0pEHY9P3Y9V14BQyvzZgdh1bWAEyTUn02uFM=","text":"2.28. Project: Project is a research work aimed at testing the ability of a student to\ntranslate the theoretical knowledge acquired during a course of study into its\npractical application at Undergraduate Program. 2.29. Probation: A student is said to be on probation if he/she is deficient in\nstandards to the extent where he/she is likely to be relegated/withdrawn, is\nallowed to continue studies for one semester (in Two Years degree Program)\nand for two semesters (in Four Years degree Program). The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 3 of 38\n2.30. Research/Project Report: A report comprising the original research of a\nstudent/researcher which is counted towards the partial fulfillment of his/her\ndegree subject to fulfillment of relevant prescribed procedure. 2.31. Registrar: The Registrar of the University of Haripur. 2.32. Registration: Registration of the student with the office of the Registrar of the\nUniversity of Haripur. 2.33. Research/Project Supervisor: A Teacher who supervises/guides\nResearch/Project of an undergraduate Student till the successful completion of\nresearch work. The Supervisor must have prescribed experience and relevant\nqualification in the field of research. 2.34. Semester: an academic period (mentioned in the Academic Calendar of the\nUniversity), in which one set of courses in any discipline is offered. 2.35. Teacher: A person serving in an academic department as lecturer, Assistant\nProfessor, Associate Professor or Professor. 2.36. Theory: A theory course is of 03 to 04 credit hours as per requirement of the\ndiscipline; time duration of the credit hour in class and lab shall be measured as\nbelow:\nCourse Duration of Class\n3 classes of 01 hour per week Or\nTheory Course of 03 Credit Hours 2 classes of 1.5 hour per week Or\n1 class of 03 hours class per week\nPractical (Lab)Work/Field Work of\n01Credit Hour 03 hours per week\n2.37.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"48ee9063-b39c-4e09-bb08-5624bc618769":{"id_":"48ee9063-b39c-4e09-bb08-5624bc618769","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d3e120c4-0c60-4c69-a350-75e2066c85a0","metadata":{},"hash":"afF9QJt0pEHY9P3Y9V14BQyvzZgdh1bWAEyTUn02uFM="},"NEXT":{"nodeId":"50623e22-3e09-4faa-b408-4b87e1133880","metadata":{},"hash":"kZawaVQAyqphB50EzZFtP0NZtyfqg1qaXz+dfrrGGXc="}},"hash":"UWN/LaNSCYiU/GDlSTc4G5lr04kGhhf5K7RIOq88Z9Q=","text":"Undergraduate Program: A 16 years educational program including\nBS (4 Years), B.Sc (Honors), MA/MSc (2 Years) or equivalent Program. 2.38. Unfair Means Committee: A committee appointed to deal with cases\npertaining to use of unfair means in the examination by the students. 2.39. Vice Chancellor: The Vice Chancellor of the University of Haripur. ………………………………………………………………………………………………….. 3. INTRODUCTION\n3.1. The University of Haripur shall offer undergraduate study programs in the\nsubjects approved in prescribed manner. 3.2. Admission to the University is open to all eligible candidates without distinction\nof caste, creed, gender, or place of origin or domicile. Application for admission\nto various courses of study shall be invited from all over Pakistan. However,\nforeign students seeking admission to the University shall be required to submit\ntheir applications through the Ministry of Education, Government of Pakistan or\nother lawfully authorized quarters. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 4 of 38\n3.3. Any quota of admissions formally approved by the University of Haripur's\nrelevant bodies/authorities shall be maintained accordingly. 3.4. Admissions in the University shall be regulated through “The University of\nHaripur Admission Rules & regulations in vogue. ………………………………………………………………………….. 4. SEMESTERS\n4.1. FALL / SPRING Semesters: There will be two regular semesters (Fall and\nSpring) in an academic year. 4.2. Each semester will be spread over 16-18 weeks (inclusive of 1-2 weeks for\nexaminations). 4.3. University/institutes/colleges are at liberty to enroll students (if they fulfill\nadmission criteria) for any semester and issue transcript with letter grades\nat the end of the semester. The Fall semester shall start in September and\nthe Spring semester shall start in February each year.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"50623e22-3e09-4faa-b408-4b87e1133880":{"id_":"50623e22-3e09-4faa-b408-4b87e1133880","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"48ee9063-b39c-4e09-bb08-5624bc618769","metadata":{},"hash":"UWN/LaNSCYiU/GDlSTc4G5lr04kGhhf5K7RIOq88Z9Q="},"NEXT":{"nodeId":"f33ab74c-cc85-4751-a232-3a58885a614f","metadata":{},"hash":"xfDqY5wiuODYqHi6nnfp+mw0hZzfpTlODo/OlABlxf8="}},"hash":"kZawaVQAyqphB50EzZFtP0NZtyfqg1qaXz+dfrrGGXc=","text":"The Fall semester shall start in September and\nthe Spring semester shall start in February each year. In case the teaching\nin the whole of the University is suspended because of some exigency, the\nperiod of the semester shall be extended to the extent of the lost period of\ntime or as the university management decides within the legal framework. 4.4. Summer/condensed Semester: Summer Semester will be of 8 – 9 weeks\n(inclusive of examination) of concentrated study for completing remedial\ncourse work. 4.5. Depending on the availability of staff and necessary facilities (subject to\nfinancial feasibility and willingness of the teacher concerned). Students can\nenroll maximum of 2 courses during summer semester. 4.6. Summer semester will be offered as an optional semester. Students will be\noffered courses to remove deficiencies and can enroll in up to a maximum of 08\ncredit hours during summer (as mentioned in 4.5 above). 4.7. Moreover, a student who has either failed or has been stopped to take the\nexamination due to shortage of class attendance or wishes to improve\nhis/her grade is allowed to register in summer/condensed semester. 4.8. The contact hours per week during the Summer Semester will be doubled to\nensure that the course is completely taught in a summer session with half of\nthe duration as compared to a regular (Fall/Spring) semester. …………………………………...................................... The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 5 of 38\n5. DEGREE STANDARDIZED FORMAT SCHEME OF STUDIES\n5.1. Four Year undergraduate degree programs\n5.2. Two year undergraduate degree programs\na. Total No. of Credit Hours 60 – 70\nb. Semester Duration 16 – 18 Weeks\nc. Number of Regular Semesters 04 Semesters\nd. Course Load per Semester 15 – 18 Credit Hours\n5.3.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"f33ab74c-cc85-4751-a232-3a58885a614f":{"id_":"f33ab74c-cc85-4751-a232-3a58885a614f","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"50623e22-3e09-4faa-b408-4b87e1133880","metadata":{},"hash":"kZawaVQAyqphB50EzZFtP0NZtyfqg1qaXz+dfrrGGXc="},"NEXT":{"nodeId":"e8fcfc16-fa52-459e-bd94-dcdd5726bfe9","metadata":{},"hash":"VYad6j2OxQC8MCUpZs339iMeixyhca1mm55YTLkDI98="}},"hash":"xfDqY5wiuODYqHi6nnfp+mw0hZzfpTlODo/OlABlxf8=","text":"Course Load per Semester 15 – 18 Credit Hours\n5.3. Internship: Students may do internship of minimum three (3) Credit Hours in\na relevant academic, research or business organization (as per HEC\nguideline relevant to departments/programs) offered in any upper division\nsemester as per requirement of the discipline. 5.4. Project/Research: Every student shall write a project/research/internship\nreport in the final year up to maximum of 06 credit hours (as per HEC\nguideline relevant to departments/ programs) individually on a research topic\napproved by the faculty member/supervisor. The student may take 2 courses\nin lieu of the report, If, otherwise allowed by the approved Scheme of\nStudies. ……………………………………………………………………………….. 6. ASSOCIATE DEGREE PROGRAM\nThe primary types of Associate Degree are:\na) Associate Degree in Arts (ADA)\nb) Associate Degree in Science (ADS). a. Total No. of Credit Hours 124 – 140\nb. Semester Duration 16 – 18 Weeks\nc. Number of Regular Semesters 08 Semesters (4 years)\nd. Course Load per Semester 15 – 18 Credit Hours\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 6 of 38\nc) Associate Degree in Applied Science (ADAS)\nd) Associate Degree in Social Science (ADSS)\n6.1. Guidelines for Associate Degree Program\na) Admission requirement for Associate Degree shall be\nIntermediate/12-year schooling or equivalent. b) It shall be awarded upon completing 65-68 credit hours in a four\nsemesters/two-years program which will be offered through specially\ndesignated campuses / constituent colleges/affiliated colleges of the\nUniversity. c) The degree shall be considered equal to 14-year Bachelor (Pass)\ndegree. d) Students enrolled for Associate Degree Program may undertake BS (4\nyears) program seeking admission in 5\nth \nsemester of the program, if\nallowed by the University. e) Minimum requirement for grant of Associate Degree is CGPA 2.0 after\nfour semesters.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"e8fcfc16-fa52-459e-bd94-dcdd5726bfe9":{"id_":"e8fcfc16-fa52-459e-bd94-dcdd5726bfe9","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"f33ab74c-cc85-4751-a232-3a58885a614f","metadata":{},"hash":"xfDqY5wiuODYqHi6nnfp+mw0hZzfpTlODo/OlABlxf8="},"NEXT":{"nodeId":"a67554c1-7068-44ac-9a57-1dbbf552ff85","metadata":{},"hash":"YW9y3g2AI1LU6U28z/Rb1ZtzPwaGgTXG3uaAKLJJ8l0="}},"hash":"VYad6j2OxQC8MCUpZs339iMeixyhca1mm55YTLkDI98=","text":"[New insertion by 6\nth \nAcademic Council & 17\nth \nSyndicate]\n6.2. Forms of Associate Degree program:\nAssociate Degree program will be of two types:\nA. Program for those students who will be joining the Associate Degree\nprogram after completing 02 years Bachelor (Annual system) or have\ncompleted 4 semesters earlier. i. They have to complete 124 to 136 credit hours courses (as the case may\nbe) to earn BS (4 YEARS) degree. Their (previous qualification) passed\nBachelor shall get 50 Credit Hour equivalence. ii. They will study 15 to 18 Credit Hours as “Bridging Courses” before admitting\nthem in the 5\nth \nsemester of 4-year BS/B.Ed etc programs. iii. After passing bridging courses they will have to complete remaining 68\ncredit hours in next 4 semesters (provided that courses taken by them\nduring the 2 year Bachelor Program (Annual System) are relevant to the BS\n(4-years) degree program to which student is applying. iv. Eligibility of admissions in such cases shall be determined by the Board of\nStudies of the department concerned in accordance with the HEC policy in\nvogue. However, such admissions shall be made by following the\nuniversity‟s merit. B. Associate Degree program after intermediate or equivalent\ni. A two-year (4 semesters) academic degree primarily in market driven\nsubjects. Admission requirement for this Associate Degree programs shall\nbe Intermediate/12-year schooling or equivalent qualification and will be\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 7 of 38\nawarded upon qualifying 65-68 credit hours in four (04) semesters to be\ncompleted under a regular study program. ii. The concerned Board of Studies will make curricula of such programs. 7. DURATION OF THE UNDERGRADUATE PROGRAMS\n7.1. For completing BS (4 years) B.Sc (Honors), minimum duration shall be\neight semesters and maximum twelve semesters. 7.2.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"a67554c1-7068-44ac-9a57-1dbbf552ff85":{"id_":"a67554c1-7068-44ac-9a57-1dbbf552ff85","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"e8fcfc16-fa52-459e-bd94-dcdd5726bfe9","metadata":{},"hash":"VYad6j2OxQC8MCUpZs339iMeixyhca1mm55YTLkDI98="},"NEXT":{"nodeId":"36dd0f05-0e11-4be4-b3df-6ada023193ed","metadata":{},"hash":"RvuP7yBXYX4ntZvGLuwYIiNGmoWgPrjPbVFDapDczAs="}},"hash":"YW9y3g2AI1LU6U28z/Rb1ZtzPwaGgTXG3uaAKLJJ8l0=","text":"7.2. For MA/MSc (2 Years), minimum shall be four semesters and maximum six\nsemesters. ………………………………………………………………………………………….. 8. COURSES OF STUDY\nThe courses of study and syllabi for the various degree programs of the\nUniversity shall be approved by the respective Boards of Studies and\nsubsequently approved by the Boards of Faculty, the Academic Council\nand the Syndicate. …….……………………………………………………………………………………. 9. ORGANIZATION OF TEACHING\n9.1. Teaching in the various courses shall be conducted in the University\ndepartments or constituent institutions through lectures, tutorials,\ndiscussions, seminars, demonstrations, practical work in laboratories, field\nwork and other methods of instruction approved by the Academic Council. 9.2. Teaching in each department/institute shall be conducted by the University\nteachers or such other persons as may be allowed by the authorities. 9.3. Teaching in each department/institute shall be organized through courses\nspecified for each discipline and approved by the competent authorities as\nprescribed in the Khyber Pakhtunkhwa Universities Act, 2012 as amended\nin 2016 and statutes, rules & regulations made there under and amended\nfrom time to time. 9.4. Each student shall have to follow the syllabi and courses of study as\nprescribed by the Academic Council and the Syndicate from time to time. 9.5. English shall be the medium of instruction, except in language courses,\nIslamic Studies and/or any other course approved by the Academic Council\nand the Syndicate (Examination of Islamic Studies / Pakistan Studies shall\nbe optional in Urdu or English). 10. SEMESTER‟S DUES\nUniversity dues (at the rate in vogue approved by the university‟s authorities) shall\nhave to be paid as per following schedule:\nSr.# Time of fee submission Fee\nA Within seven working days of\ncommencement of the semester. Normal semester fee\nB During 2\nnd \nweek (7 working days) of\ncommencement of the semester. Normal semester fee plus\nRs. 1000.00 fine\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"36dd0f05-0e11-4be4-b3df-6ada023193ed":{"id_":"36dd0f05-0e11-4be4-b3df-6ada023193ed","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"a67554c1-7068-44ac-9a57-1dbbf552ff85","metadata":{},"hash":"YW9y3g2AI1LU6U28z/Rb1ZtzPwaGgTXG3uaAKLJJ8l0="},"NEXT":{"nodeId":"aa85eb6a-e22d-42b3-8a48-574641290ee1","metadata":{},"hash":"+211NzoGUSS4PYbYKOtgBOxEfr1GQrjNqcaNpfFlrCs="}},"hash":"RvuP7yBXYX4ntZvGLuwYIiNGmoWgPrjPbVFDapDczAs=","text":"2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 8 of 38\nC During 3\nrd \nweek (7 working days) of\ncommencement of the semester. Normal semester fee plus\nRs. 2000.00 fine\nD Till one week (seven working days)\nbefore commencement of Mid-term\nExamination\nNormal semester fee plus\nRs. 3000.00 fine\nE Till one week (seven working days)\nbefore commencement of Terminal\nExamination\nNormal semester fee plus\nRs. 5000.00 fine\nf. However, if a student fails to submit the dues as per schedule mentioned\nabove (a to e) due to some genuine reasons with valid/documentary proofs,\na committee comprising of the HoD (convener) and two senior faculty\nmembers of the department concerned and the Provost shall decide such\ncases accordingly and place recommendations to the Vice Chancellor\nthrough concerned Dean for final decision. (read in conjunction with\nSection 29 and section 11 of the Annexure-A of Rule 33 of the Semester\nRules & Regulations). Amended in 6\nth \nAcademic Council and approved by 17\nth \nSyndicate. 10.1. Fee Refund\nIn case of cancellation of an admission in a discipline, program or\ndepartment, refund of the deposited fee shall be as under:\n%age of Tuition Fee \nTimeline of Semester\nSystem \nTime for Annual System\nFull (100%) fee\nrefund\nUp to 7\nth \nday of\ncommencement of classes\nUp to 15\nth \nday of\ncommencement of classes\nHalf (50%) fee\nrefund\nFrom 8\nth \n– 15\nth \nday of\ncommencement of classes\nFrom 16\nth \n– 30\nth \nday of\ncommencement of classes\nNo fee (0%) refund \nFrom 16\nth \nday of\ncommencement of classes\nFrom 31\nst \nday of\ncommencement of classes\nAmended in 6\nth \nAcademic Council and approved by 17\nth \nSyndicate. 10.2.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"aa85eb6a-e22d-42b3-8a48-574641290ee1":{"id_":"aa85eb6a-e22d-42b3-8a48-574641290ee1","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"36dd0f05-0e11-4be4-b3df-6ada023193ed","metadata":{},"hash":"RvuP7yBXYX4ntZvGLuwYIiNGmoWgPrjPbVFDapDczAs="},"NEXT":{"nodeId":"c662ae13-d156-4005-8383-6938b8010e26","metadata":{},"hash":"HdhvpycKoK1tdVv7I5iWImccdqSYEYXlq2WUV+G+guM="}},"hash":"+211NzoGUSS4PYbYKOtgBOxEfr1GQrjNqcaNpfFlrCs=","text":"10.2. Dual Enrollment: All cases of dual enrollment/multiple degrees during\nsame period of time shall be dealt in accordance with the HEC policy in\nvogue (current HEC's policy was notified vide No. DUAL\nDEGREE/AD-1/QA/HEC/2015/674, dated November 13, 2015). 10.3. Credit Hours\nThe credit hours are denoted by two digits within brackets with a\nhyphen/plus in between. The first digit represents the theory part while the\nsecond (right side) digit represents the practical. Thus 3(3+0)/3(3-0) means\nthree credit hours of theory, while 4(3+1)/4(3-1) means a total of four credit\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 9 of 38\nhours, of which three are of theory while one credit hour is for\nlaboratory/studio work/field work/practical work supervised and graded by\nthe faculty, and 4(1+3)/4(1-3) means a total of four credit hours, of which\none is of theory while three credit hours are for laboratory/studio work/field\nwork/practical work as per requirement of discipline. 10.4. Minimum & Maximum Course Load (Credit Hrs) in a Regular (Fall/Spring)\nSemester\nA department can offer a minimum 12 credit hours in a regular semester and\nmaximum of 18 credit hours. Any student who wishes to enroll for more than\n18 credit hours may be allowed to take one more course if his/her CGPA is\nabove 3.5 or in case of repeating failed/dropped courses with the prior\npermission of the Chairperson/Head of the Department/Principal\nconcerned. [Sign “/” deleted after word “repeating” by 6\nth \nAcademic Council &\napproved by 17\nth \nSyndicate. ]\n10.5. A credit hour means teaching a theory course for 60 minutes each week\nthroughout the semester. 10.6.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"c662ae13-d156-4005-8383-6938b8010e26":{"id_":"c662ae13-d156-4005-8383-6938b8010e26","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"aa85eb6a-e22d-42b3-8a48-574641290ee1","metadata":{},"hash":"+211NzoGUSS4PYbYKOtgBOxEfr1GQrjNqcaNpfFlrCs="},"NEXT":{"nodeId":"c8e8fc75-b287-48d8-92b4-9877efefe37e","metadata":{},"hash":"pUV+zFJ/g8+UVhPwewIeqxIivWuHDCLkFW5XGHMfD+Q="}},"hash":"HdhvpycKoK1tdVv7I5iWImccdqSYEYXlq2WUV+G+guM=","text":"10.6. One credit hour in laboratory or experimental work would require lab contact\nof three hours per week throughout the semester. 10.7. The contact hours during the Summer Session will be doubled to ensure\nthat the course is completely taught in a semester with half of the duration\ncompared with a regular (Fall/Spring) semester. ………………………………………………………………………………\n11.1 M. Ed PROGRAM\na. The M.Ed (one year) course will extend over a minimum period of two\nSemesters and maximum of three semesters. b. Minimum of 30 credits is required for M.Ed Program. 11.2 B. Ed PROGRAM\n1. B. Ed (1.5 years) Secondary Program;\na. Course of B.Ed (1.5 years) Secondary program shall extend over minimum of\nthree Semesters and maximum of five semesters. b. MA/MSc or equivalent qualification is required for admission in B.Ed\nSecondary (1.5-years) Program. 2. B. Ed (2.5 years) Secondary Program\na. Program Course of B.Ed (2.5 years) Secondary program will extend over a\nminimum of five Semesters and maximum of seven semesters. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 10 of 38\nb. BA/BSc or equivalent qualification is required for admission in B.Ed\nSecondary (2.5-years) Program. ……………………………………………………………………………….. 12. ACADEMIC CALENDAR\nThe University of Haripur shall publish “Academic Calendar” reflecting complete\nschedule of the academic year. The Academic Calendar shall be prepared by a\ncommittee comprising Head of the Academic Section of the Registrar Office\n(convener), Controller of Examination, Director ASRB, Provost and one HOD from\nfaculty nominated by Dean concerned.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"c8e8fc75-b287-48d8-92b4-9877efefe37e":{"id_":"c8e8fc75-b287-48d8-92b4-9877efefe37e","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"c662ae13-d156-4005-8383-6938b8010e26","metadata":{},"hash":"HdhvpycKoK1tdVv7I5iWImccdqSYEYXlq2WUV+G+guM="},"NEXT":{"nodeId":"9d3be426-eac7-48fa-9035-15ce0cfb3aa2","metadata":{},"hash":"H1SYoCQTdFbI9goaOUZR3Viyatu/j/BnqYdddvNHpkE="}},"hash":"pUV+zFJ/g8+UVhPwewIeqxIivWuHDCLkFW5XGHMfD+Q=","text":"The Calendar will be issued after approval\nof the Vice Chancellor before commencement of the semester of the Academic\nYear mentioning the following items:\n Semester starting dates\n Mid-term exams\n Holidays\n Terminal exams‟ prep week\n Schedule of terminal exams\n Result notification date\n Sports schedule etc.\n Admission announcement\n\na. Students are responsible to meet the requirements and deadlines given for\neach activity in the academic calendar of the University. Students will also be\nexpected to know and adhere to the rules, regulations, course loads,\npre-requisites, and policies of the University, as well as those of the\ndepartments / institutes in which they are enrolled. b. In case, the University is closed owing to the circumstances beyond the control,\nthen special makeup classes will be arranged converting weekends or holidays\nto working days to cover the lapsed period of students. c. For affiliated colleges/institutes a separate committee shall comprise of the\nfollowing members to recommend/propose the Academic Calendar:\nHead of the Academic Section of the Registrar Office (convener), Controller\nExamination, Principals of the concerned colleges/institutes two from public\nsector (preferably one boys and one girls‟ college) and one from private sector. 13. WITHDRAWAL / DROP/ CHANGE OF COURSE(S)\n13.1. Drop/Change of Course\na. When a course, for which a student has enrolled, cannot be offered according to\nthe announced Program, the student may take an alternative course. However,\nthis must be done not later than 7 days after the date of enrollment and in this\ncase students will not pay dues afresh. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 11 of 38\nb. A student, with the consent of the concerned Dean/Head of\nDepartment/Principal, may be allowed to\ni. Change a course within 14 working days of the commencement of a\nsemester, and\nii. Drop a course within three weeks of the commencement of semester. c.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"9d3be426-eac7-48fa-9035-15ce0cfb3aa2":{"id_":"9d3be426-eac7-48fa-9035-15ce0cfb3aa2","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"c8e8fc75-b287-48d8-92b4-9877efefe37e","metadata":{},"hash":"pUV+zFJ/g8+UVhPwewIeqxIivWuHDCLkFW5XGHMfD+Q="},"NEXT":{"nodeId":"d45c0675-b0f2-474d-89d1-d01f3697be1f","metadata":{},"hash":"zQ0QlVEhB8hHvv8G4x8sqn9yD/gUjLVIZVFJVcVqH0I="}},"hash":"H1SYoCQTdFbI9goaOUZR3Viyatu/j/BnqYdddvNHpkE=","text":"Drop a course within three weeks of the commencement of semester. c. A student may convert a credit course into a non-credit course or vice versa\nwithin 14working days from the date of commencement of a semester on the\nrecommendations of the Chairperson/Head of the department\nconcerned/Principal of the college/Director of a Center. d. A student can drop an entire semester after registration/renewal, however,\nhe/she shall be required to pay semester charges for that semester\ne. The semester shall be dropped provided the student seeks permission of the\nChairperson of the Department/Principal/Dean of the Department/ college/\nfaculty concerned before the commencement of the terminal exam. f. The dropped semester shall be counted towards the maximum number of six\nsemesters allowed for completion of Master‟s degree/two-year programs\nand twelve semesters for completion of BS degree/four-year programs,\nprovided further that the dropped semester will not be counted towards\nCGPA. 13.2. Withdrawal of Course\na. Students are allowed to withdraw from a course within fourteen working days\nof the commencement of the semester. In such a case the transcript shall\nrecord that the student enrolled in the course and withdrew. Consequently,\ngrade W will be awarded to the student which shall have no impact on\ncalculation of the GPA of the student. b. A student withdrawing after the 4th week of the commencement of semester\nshall be automatically awarded “F” grade which shall count in the GPA. ……………………………………………………………………………\n14. REPEATING OF COURSES (to pass and to improve)\n14.1 Those failing in any course or having shortage of attendance shall have to\nrepeat that or an equivalent course whenever offered to pass. 14.2 Whenever a student gets „D‟ grade in a course, he/she can repeat the course\nwhenever offered to improve his/her GPA/CGPA. 14.3 Students are allowed to repeat maximum of six failed courses in four(4)\nyears programs and three failed courses in two(2) year programs to pass\ntheir failed courses during his/her entire degree program. 14.4 Attendance shall not be mandatory in the courses for which one has\nregistered for improvement of grades. And it will be the sole responsibility of\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d45c0675-b0f2-474d-89d1-d01f3697be1f":{"id_":"d45c0675-b0f2-474d-89d1-d01f3697be1f","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"9d3be426-eac7-48fa-9035-15ce0cfb3aa2","metadata":{},"hash":"H1SYoCQTdFbI9goaOUZR3Viyatu/j/BnqYdddvNHpkE="},"NEXT":{"nodeId":"e2ba86ff-7854-45a2-9caa-b5b7d63983b8","metadata":{},"hash":"og+3P88YGZgg7t/hFdt5QwpODz6NoEHGudofFrz4iW0="}},"hash":"zQ0QlVEhB8hHvv8G4x8sqn9yD/gUjLVIZVFJVcVqH0I=","text":"2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 12 of 38\nthe concerned student to coordinate with the subject teacher regarding class\nquiz, assignments, presentation etc. 14.5 The failed courses repeated by a student in Summer/Condensed Semester\nshall also be counted towards the maximum of six courses for BS (4 Years)\nand three courses for MA/MSc (Two Years) programs as mentioned in 14.3\nabove. 14.6 In addition to six chances allowed for passing failed courses (ref Section\n14.3), the students are allowed to repeat 4 courses for improvement in a (4\nYears) Program and 2 courses in a (2 Years) Program in which he secured\nGP less than 2.00. 14.7 A student desirous of improving grade(s) having CGPA less than 3 may be\nallowed to repeat not more than four course(s) for BS(4 Years) Program & Two\ncourses for MA/MSc (2 Years),by the Head of relevant department, with\ninformation to the controller of examination ,after declaration of the result of the\nfinal semester (end of Program), subject to the condition that number of courses\nso improved do not exceed the number of improvements i.e. four course(s) for\nBS(4 Years) & Two courses for MA/MSc (2 Years) as mentioned in section14.6. 14.8 Improvements mentioned in 14.7 above shall be allowed within two semesters\nafter declaration of the result of final semester (end of program). After improving\ncourse(s), if one gets the grade less than the previous, the previous grade will\nbe counted towards his/her result. 14.9 In case a student repeats the failed course which has already been taken,\ni. The old grade will be replaced with the new grade, (for CGPA calculation). ii. but in case a student takes a new course in lieu of the course in which\nhe/she failed, both the grades will reflect on his/her transcript, i.e. old\ncourse grade (for information only) and new course grade for calculation\nof grade. The CGPA will be calculated on the base of New Course.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"e2ba86ff-7854-45a2-9caa-b5b7d63983b8":{"id_":"e2ba86ff-7854-45a2-9caa-b5b7d63983b8","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d45c0675-b0f2-474d-89d1-d01f3697be1f","metadata":{},"hash":"zQ0QlVEhB8hHvv8G4x8sqn9yD/gUjLVIZVFJVcVqH0I="},"NEXT":{"nodeId":"751282ec-5f0f-464e-accf-c83949c21cda","metadata":{},"hash":"Zms09xwotVpGYGKdumIvygzkipfikVlkeP9nV5m8fwM="}},"hash":"og+3P88YGZgg7t/hFdt5QwpODz6NoEHGudofFrz4iW0=","text":"The CGPA will be calculated on the base of New Course. 14.10 Students repeating complete semester shall be charged for full semester and\nfor the leftover subjects, fee shall be charged on per subject basis with semester\nregistration fee (read in conjunction with section14.3). 15. ATTENDANCE\n15.1. A student will be allowed to appear in examination only if he/she has attended,\nnot less than 75% of the lectures/seminars delivered to his/her class in each\ncourse and 75% of the practical/laboratory demonstrations prescribed for the\nrespective courses. 15.2. Counting of attendance shall start from the date of commencement of the\nclasses/semester. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 13 of 38\n15.3. A date -wise record of the attendance of students shall be maintained by each\nteacher and will be displayed on the notice board at the end of every month by the\nconcerned Department. 15.4. The period of absence in case of participation in co-curricular/sports activities\noutside of The University of Haripur, with the permission of the Competent\nAuthority shall not be counted, as absence. 15.5. Students short of attendance will be detained and examination admit-cards will\nnot be issued to such students. 15.6. Students having class attendance less than 75% in a particular course will be\nrequired to repeat the course when it is offered again. 15.7. In addition to „F‟ grade awarded on the basis of academic failure, a student\nhaving less than 75% attendance will also be awarded „F‟ grade in that subject. The „F‟ grade(s) so obtained will only be cleared by repetition of the course(s)\nwhenever offered, so that the students are made to attend the missed courses. 15.8.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"751282ec-5f0f-464e-accf-c83949c21cda":{"id_":"751282ec-5f0f-464e-accf-c83949c21cda","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"e2ba86ff-7854-45a2-9caa-b5b7d63983b8","metadata":{},"hash":"og+3P88YGZgg7t/hFdt5QwpODz6NoEHGudofFrz4iW0="},"NEXT":{"nodeId":"459751c2-014d-44a1-98e2-d6fd896ad90f","metadata":{},"hash":"KQoSnFMw6Z/ztnfXPtX1uWvV63fnpo89wc+FIsYigK8="}},"hash":"Zms09xwotVpGYGKdumIvygzkipfikVlkeP9nV5m8fwM=","text":"15.8. Absence from class for two consecutive weeks or more (two weeks means six\nclasses of a three credit hours course and four classes of a two credit hours\ncourse) without any genuine reason shall entail cancellation of admission in the\ncourse by the class teacher which would only be restored on appeal to the\nconcerned teacher made within 05 days of the cancellation with payment of\nRs.500/-. The Chairperson/Head of the Department will notify the cancellation\nand restoration of admission in the course. 15.9. Leave up to 07 days shall be sanctioned by the Chairperson/HoD/Principal of\nthe Department/institute concerned. Sanction of leave beyond seven days will\nbe granted by the Vice Chancellor on the recommendations of the\nChairperson/Dean/Principal concerned. The maximum leave period to be\navailed in exceptional cases on very genuine grounds in one semester will not\nexceed thirty (30) days. (However the total percentage of attendance must be\n75% after availing the leave, failing which student will not be eligible to appear\nin Terminal Exam. 15.10. There shall be no additional relaxation in attendance, however, in case of\nfemale students extra waiver in attendance shall be sanctioned by the Vice\nChancellor for certain genuine/physiological reasons like child birth, husband‟s\ndeath or divorce etc. [New insertion by 6\nth \nAcademic Council & 17\nth \nSyndicate]\n15.11. Class attendance record:\na. Teacher shall record/update students‟ attendance within 5 working days of\na particular week. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 14 of 38\nb. If a teacher could not record attendance as mentioned in clause (a) above,\nhe/she will apply with valid reasons to the Chairperson/Head of the\nDepartment to update his attendance record at the end of same month. c.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"459751c2-014d-44a1-98e2-d6fd896ad90f":{"id_":"459751c2-014d-44a1-98e2-d6fd896ad90f","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"751282ec-5f0f-464e-accf-c83949c21cda","metadata":{},"hash":"Zms09xwotVpGYGKdumIvygzkipfikVlkeP9nV5m8fwM="},"NEXT":{"nodeId":"2807afce-5b2f-4ddc-aecc-7290c6db5f69","metadata":{},"hash":"Ghx76AZ4/rxOQA1piNHmszBxWCSe9siWUZ4zwoxEjIQ="}},"hash":"KQoSnFMw6Z/ztnfXPtX1uWvV63fnpo89wc+FIsYigK8=","text":"c. In case of compliant placed by a student or there exist any ambiguity with\nregard to student‟s attendance, a committee comprising of concerned\nDean, Chairperson/HoD and the teacher under headship of the Dean shall\nlisten to the student/consider the matter and decide in writing, which shall be\nconsidered final. [New insertion by 6\nth \nAc. Council & approved by 17\nth \nSyndicate]\n16. MAKE-UP TEST/EXAMINATION:\n16.1. Make up test will be given on the request of those students who have fulfilled all\nrequirements for appearing in the Mid/Final Term Examination but could not\nappear for any genuine reason/acute emergency or unavoidable\ncircumstances/accidental health problem/ death of parents/ spouse/ children/\nbrother/sister or similar) or due to attending sports/national/international event\non behalf of the University. 16.2. Make-up Examination shall be conducted within 2 weeks of the end of the\nExamination on approval of the Chairman/HoD concerned. 16.3. The pattern, i.e. nature and number of questions and weightage of the Make-up\nExamination shall be same as of the regular exam. 16.4. Student, except those who couldn‟t appear in regular exam for representing the\nuniversity in some event, appearing in the Make-up Examination shall be\ncharged examination fee for leftover paper(s) as the case may be. 16.5. There will be no Makeup/Special Examination in a semester for failed students;\nif a student fails in a course, he/she is required to repeat it. ……………………………………………………………………………………. 17. TRANSFER OF CREDIT HOURS\n17.1. Credit hours shall only be transferred between the University of Haripur and\nchartered Universities/Institutes. No credit hour of a course shall be transferred to the University of Haripur if:\na. the grade is less than C for undergraduate programs and\nb. the student has not secured approval from the concerned Departmental\nAdmission Committee regarding the availability of seats and\nrelevance/adequacy of courses taken by the student in the previous\ninstitution/program. 17.2.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"2807afce-5b2f-4ddc-aecc-7290c6db5f69":{"id_":"2807afce-5b2f-4ddc-aecc-7290c6db5f69","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"459751c2-014d-44a1-98e2-d6fd896ad90f","metadata":{},"hash":"KQoSnFMw6Z/ztnfXPtX1uWvV63fnpo89wc+FIsYigK8="},"NEXT":{"nodeId":"d8f5097f-6c00-4d2d-bf2d-df4965ea79de","metadata":{},"hash":"hJ1ugpZ1oYippkVXgQyaD3QWS5uEpMFgIsBnggxBJdc="}},"hash":"Ghx76AZ4/rxOQA1piNHmszBxWCSe9siWUZ4zwoxEjIQ=","text":"17.2. Transfer of credit Hours from the University of Haripur shall not be allowed\nbefore the completion of 3\nrd \nsemester for BS/4 Years and 2\nnd \nsemester for\nMA/MSc/2 Years programs. ………………………………………………………………………………………. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 15 of 38\n18. MIGRATION:\nMigration shall be allowed between the colleges/institutes affiliated with the UoH\nor other universities. All such cases shall be considered as per policy in vogue of\nthe Directorate of Colleges/HED, Govt. of Khyber Pakhtunkhwa. …………………………………………………………………………………. 19. EVALUATION OF DIFFERENT COMPONENTS OF TESTS\n19.1. A student shall be evaluated in each course on the basis of\na. sessional tests,\nb. class assignments,\nc. quizzes,\nd. mid-terms,\ne. Terminal examinations. f. presentation,\ng. projects/lab reports\nThe above tests (from 1 to vii) carry different weightages and contribute towards the\noverall assessment in percent marks. 19.2. Following weightage shall be given to the different components of the\nexaminations, assignments etc. for each course in each semester:\nCourses without practical(s)\nEvaluation Category Distribution of Marks\nClass tests/ Quizzes/ 10%\nAssignments/Presentations etc 15%\nMid Term 25%\nTerminal examination 50%\nCourses with practical(s)\nEvaluation Category Distribution of Marks\nClass tests/ Quizzes/ 5%\nAssignments/Presentations etc 5%\nPractical 15%\nMid Term 25%\nTerminal examination 50%\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 16 of 38\nNote:\na) All the above mentioned evaluation categories shall have the documentary\nevidence. b) Results of class tests, quizzes, assignments and presentations shall be\nsubmitted 10 days before the commencement of terminal examination.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d8f5097f-6c00-4d2d-bf2d-df4965ea79de":{"id_":"d8f5097f-6c00-4d2d-bf2d-df4965ea79de","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"2807afce-5b2f-4ddc-aecc-7290c6db5f69","metadata":{},"hash":"Ghx76AZ4/rxOQA1piNHmszBxWCSe9siWUZ4zwoxEjIQ="},"NEXT":{"nodeId":"a0720f21-9eea-4dc9-9833-974fd4340a43","metadata":{},"hash":"BU/+nOdNfwkwuPG52+fEVJYXzq5HtsFH5SclmCdR9/c="}},"hash":"hJ1ugpZ1oYippkVXgQyaD3QWS5uEpMFgIsBnggxBJdc=","text":"b) The marks in missed quizzes etc will be zero, however, quizzes,\nassignments, presentations can be arranged in consultation with the\nteacher/Head of Department in genuine cases and marks will be considered\n……………………………………………………………………………………….. 20. GRADING POLICY\nLetter grading should only be used for representing the individual courses and\nnot to report the semester GPA/CGPA. 20.1. The percentage of marks or values of grades other than grade points should not\nbe reported on the transcripts. 20.2. The minimum pass marks for each course as well as lab work shall be (fifty\npercent) 50%. A student obtaining less than 50% marks in any course/test shall\nbe considered failed in that course/test. Less than 50% marks in any course\nshall not be counted towards the aggregate marks. 20.3. The equivalence between letter grading and numerical grading shall be as\nfollow: Percentage of marks shall be calculated up to one significant figure. If\nthe first fraction after decimal is 4 or less, it will be ignored. However, if the first\nfraction is 5 or more, it will be taken into account by raising the percentage to\nthe next higher digit. 20.4. The result of a student in each course having passed or failed shall be indicated\non the transcript by letter grade. For a student completing his/her study\nprogram in the normal prescribed period / semesters, a mention to this effect\nshall be made in their transcripts. 20.5. Keeping in view the variations related to both academic systems (semester and\nannual system), the following equivalence of GPA/CGPA and percentage shall be\nthe grading policy:\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"a0720f21-9eea-4dc9-9833-974fd4340a43":{"id_":"a0720f21-9eea-4dc9-9833-974fd4340a43","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d8f5097f-6c00-4d2d-bf2d-df4965ea79de","metadata":{},"hash":"hJ1ugpZ1oYippkVXgQyaD3QWS5uEpMFgIsBnggxBJdc="},"NEXT":{"nodeId":"082af83b-f119-4d54-8f80-38113a5bc7e2","metadata":{},"hash":"IdZhn0xL03CbMKP8UsqWDf/sCVOmJvwobSzfwQtkZuM="}},"hash":"BU/+nOdNfwkwuPG52+fEVJYXzq5HtsFH5SclmCdR9/c=","text":"2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 17 of 38\nMarks Range (in %) Grade Point Grade\n*\n90 and above 4.00 A+\n85 – 89 4.00 A\n80 – 84 4.00 A-\n75 – 79 3.5 – 3.9 B+\n73 – 74 3.3 – 3.4 B\n70 – 72 3.0 – 3.2 B-\n66 – 69 2.6 – 2.9 C+\n63 – 65 2.3 – 2.5 C\n60 – 62 2.0 - 2.2 C-\n50 – 59 1.0 -1.9 D\n0 – 49* 0.00 F\nIncomplete - I\nWithdrawal - W\n*fraction is to be rounded as a whole. 21. CONVERSION OF ANNUAL SYSTEM MARKS TO GPA/CGPA\nPercentage obtained in Annual\nGrade Grade Points\nSystem\n85% and above A 4.00\n70% - 84% A- 3.66 - 3.99\n55% - 69% B 2.66 - 3.65\n45% - 54% C 1.66 – 2.65\n33% - 44% D 1.00 – 1.65\nLess than 33% Fail F 0.00\nNote:\na) The range of marks defined above for a particular grade may be split\nfurther to reflect incremental grade points. b) This conversion table is only for the purpose of students who have\nobtained degrees under the annual system. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 18 of 38\n22. COMPUTATION OF SEMESTER GRADE POINT AVERAGE (GPA) AND\nCUMULATIVE GRADE POINT AVERAGE (CGPA).","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"082af83b-f119-4d54-8f80-38113a5bc7e2":{"id_":"082af83b-f119-4d54-8f80-38113a5bc7e2","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"a0720f21-9eea-4dc9-9833-974fd4340a43","metadata":{},"hash":"BU/+nOdNfwkwuPG52+fEVJYXzq5HtsFH5SclmCdR9/c="},"NEXT":{"nodeId":"de420c22-3a8a-44a9-a16b-906f99fcfe1c","metadata":{},"hash":"0kuIQdAEPEKL2H9uGwhG6v7WFxYZHxcRxLos2RrN+p8="}},"hash":"IdZhn0xL03CbMKP8UsqWDf/sCVOmJvwobSzfwQtkZuM=","text":"22.1 GPA: This is a figure ranging preferably from 0.00 to 4.00 be used to indicate\nthe performance of a student in a particular semester. 22.2 CGPA: This is a figure ranging preferably from 0.00 to 4.00 be used to indicate\nthe performance of a student in two or more semesters. 22.3 Semester Grade Point Average (GPA) and Cumulative Grade Point Averages\n(CGPAs) will be calculated using the following relationships:\nSum over all courses in a Semester (Course Credit Hours x Grade Point Earned)\nGPA = -----------------------------------------------------------------------------------------------------------\nTotal Semester Credit Hours\nCGPA= Sum over all taken courses in all Semesters (Course Credit Hours x Grade\nPoint Earned) Total Credit Hours taken in all Semesters\n22.4 CGPA Required for Degree Completion: The minimum qualifying CGPA for\ncompletion of an undergraduate level is 2.00. ……………………………………………………………………\n23. PROMOTION, PROBATION, DROPOUT AND RE-ADMISSION\n23.1 Promotion from First Semester to Second Semester\na. An undergraduate student with Grade Point Average (GPA) of 2.0 and\nabove in the first semester shall be promoted to the second semester. b. An undergraduate student with GPA 1.50 or more but less than 2.0 in the\nfirst semester shall be promoted to the second semester on “Probation”. c. An undergraduate student with GPA less than 1.50 in the first semester\nshall be dropped from the Program and Roll of the University. Clauses a, b & c were recommended in 6\nth \nAcademic Council, approved by 17\nth \nSyndicate. 23.2 Promotion from the Second and Subsequent Semesters\na. An undergraduate student with Cumulative Grade Point Average (CGPA) of 2.0 and\nabove shall be promoted to the next semester. b. An undergraduate student with CGPA 1.50 or more but less than 2.0 shall be\npromoted to the next semester on “Probation”. c. An undergraduate student with CGPA less than 1.50 shall be dropped from the\nProgram & Roll of the University. d. An undergraduate student shall be dropped from exam/Program after availing the\nmaximum probations allowed.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"de420c22-3a8a-44a9-a16b-906f99fcfe1c":{"id_":"de420c22-3a8a-44a9-a16b-906f99fcfe1c","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"082af83b-f119-4d54-8f80-38113a5bc7e2","metadata":{},"hash":"IdZhn0xL03CbMKP8UsqWDf/sCVOmJvwobSzfwQtkZuM="},"NEXT":{"nodeId":"d75952a3-411c-4c16-af7d-205ebd346c33","metadata":{},"hash":"pVA3t9zmYujzTih2B2ei9hNcHcr2wGC9ONczmBR8UI4="}},"hash":"0kuIQdAEPEKL2H9uGwhG6v7WFxYZHxcRxLos2RrN+p8=","text":"An undergraduate student shall be dropped from exam/Program after availing the\nmaximum probations allowed. Clauses a, b, c & d were recommended in 6\nth \nAcademic Council & approved by 17\nth\nSyndicate. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 19 of 38\n23.3 Probation Status\na. No probation shall be allowed in a Program comprising of two semesters\nduration. b. There shall be only one probation allowed in a Program comprising of three\nand four semesters duration. c. There shall be two probations allowed in a Program comprising of eight\nsemesters duration. d. A student who has availed his/her allowed probations, and is still unable to\nmaintain CGPA 2.0 for undergraduate shall be dropped from the Program as\nwell as from the Department/College/Institute/Center/The University of\nHaripur rolls. 23.4 An undergraduate student who has been declared to be dropped in 1\nst\n, 2\nnd \nor\nsubsequent semester may be readmitted to the first semester as a fresh\ncandidate. 24. REQUIREMENT FOR AWARD OF DEGREES\n24.1 An undergraduate student must have a proper admission/registration in the\nUndergraduate Program of the University of Haripur or in an authorized\nprogram of its constituent Institute or its affiliated college and should earn a\nminimum of 124 credit hours for his/her Bachelor (4 Years) program. 24.2 Whereas Master degree (Two Years Duration) will be awarded on successful\ncompletion of a minimum of 60 to 64 credits on same terms & conditions\nmentioned in Section 24.1. 24.3 Students of those departments where project/research is a requirement for\nundergraduate degrees will be required to carry out internship/research on a\nproject of 3 to 6 credits (as per HEC guideline relevant to departments/\nprograms) and submit a project report/dissertation as a requirement for partial\nfulfillment of their Master/Bachelor/ (Hons) degrees in their opted program.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d75952a3-411c-4c16-af7d-205ebd346c33":{"id_":"d75952a3-411c-4c16-af7d-205ebd346c33","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"de420c22-3a8a-44a9-a16b-906f99fcfe1c","metadata":{},"hash":"0kuIQdAEPEKL2H9uGwhG6v7WFxYZHxcRxLos2RrN+p8="},"NEXT":{"nodeId":"a3e3640d-2cce-4ee2-9d7d-72570dd8a3ce","metadata":{},"hash":"E1LuJPnj3USaEGa+d9N2ylDJYAYf8NGYYcdZE1Ltna4="}},"hash":"pVA3t9zmYujzTih2B2ei9hNcHcr2wGC9ONczmBR8UI4=","text":"24.4 A student will select the topic of research in consultation with his/her supervisor\nduring the 3rd semester in case of Master‟s degree and during the 7th semester\nin case of Bachelor‟s degree. 24.5 The time of summer vacation prior to or following the 4\nth\nand 8\nth\nsemester will be\nutilized for the project report/dissertation by Master‟s and Bachelor‟s degrees\nstudents, respectively. 24.6 The student will be required to do field work up to 16 weeks where necessary. 24.7 The final project/research/internship report will be submitted by the student in\nbinding form through the supervisor to the department by the end of the 4th and\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 20 of 38\n8th semester of 2-years and 4-years programs respectively or during the\nextended period. 24.8 The HOD concerned will submit the details for evaluation and viva, of\nproject/research/internship report to the controller of examination and that date\nshall be considered as cutoff date for fee calculation (read in conjunction with\nSection 14(i) of the Annexure-A of Rule 33 of the UoH Semester Rules). ………………………………………………………………………………………. 25. STUDENTS‟ GRIEVANCES REDRESSAL MECHANISM\n25.1 DEPARTMENTAL STUDENTS‟ GRIEVANCES REDRESSAL COMMITTEE\nEach Department / Institute shall have 3 members notified Departmental\nStudents‟ Grievances Committee of the senior faculty members. The\nChairperson/Head of the Department concerned may convene meetings of the\nCommittee as and when required. He/she shall maintain a regular record of the\nproceedings of the Committee. The committee shall redress the grievances of the students about any course\ninstructor or grades or for any other academic issue/grievance. Student has to write about his grievance to the Chairperson/HoD.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"a3e3640d-2cce-4ee2-9d7d-72570dd8a3ce":{"id_":"a3e3640d-2cce-4ee2-9d7d-72570dd8a3ce","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d75952a3-411c-4c16-af7d-205ebd346c33","metadata":{},"hash":"pVA3t9zmYujzTih2B2ei9hNcHcr2wGC9ONczmBR8UI4="},"NEXT":{"nodeId":"fced8329-420f-4980-8015-9ba4d8531c37","metadata":{},"hash":"SNf+mOK4N0cb5/+SP4BCfBQU5oZLOM/i/wYxsKiUShA="}},"hash":"E1LuJPnj3USaEGa+d9N2ylDJYAYf8NGYYcdZE1Ltna4=","text":"Student has to write about his grievance to the Chairperson/HoD. The head of\nthe institute / department shall forward the application to the 3 member\ncommittee and it will be binding on the committee for hearing parties, and will\ngive a final decision within 5 days or before the start of registration for the new\nsemester whichever comes early. In case the problem is not resolved by the Departmental Grievance Committee,\nthe matter shall be referred to the UoH Students‟ Grievance Committee. 25.2 THE UOH STUDENTS‟ GRIEVANCES REDRESSAL COMMITTEE\nThere shall be an appellant Committee at the University level “The University of\nHaripur Students Grievance Redressal Committee” appointed by the Vice\nChancellor consisting of 02 senior faculty members to be appointed by the Vice\nChancellor, relevant head of the department, Controller of the Examination and\nthe Dean of the concerned faculty (Convener) to redress the grievances of the\nstudents about any course instructor or grades referred by a Departmental\nGrievance Committee through the Vice Chancellor or for any other academic\nissue referred by the Vice Chancellor. The Decision of this committee shall be\nfinal in cases referred to it. ……………………………………………………………………….. 26. COURSES ON PASS / FAIL BASIS\n26.1 Courses can be taken on Pass / Fail Basis. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 21 of 38\n26.2 The maximum 9 credit hours of courses can be taken (out of electives). 26.3 The grade awarded towards these courses will not be considered for\ncalculating the GPA or CGPA. 26.4 If a student fails, he/she has to repeat the course whenever course is offered. ………………………………………………………………………………. 27. CANCELLATION OF ADMISSION\nIf a student fails to attend any lecture during the first four weeks of the\ncommencement of the semester as per announced schedule, his/her\nadmission shall stand cancelled automatically without any notice. …………………………………………………………………………………\n28. COURSE FILE\n28.1 Maintenance of Course File of each semester is compulsory for the teacher\nconcerned.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"fced8329-420f-4980-8015-9ba4d8531c37":{"id_":"fced8329-420f-4980-8015-9ba4d8531c37","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"a3e3640d-2cce-4ee2-9d7d-72570dd8a3ce","metadata":{},"hash":"E1LuJPnj3USaEGa+d9N2ylDJYAYf8NGYYcdZE1Ltna4="},"NEXT":{"nodeId":"04314082-33ae-4bf5-8a1e-eb41c0b257c4","metadata":{},"hash":"dIv/3dK2zVvQM0H0WFqqnl6WCnek6As7YjQTr/R84F0="}},"hash":"SNf+mOK4N0cb5/+SP4BCfBQU5oZLOM/i/wYxsKiUShA=","text":"28.2 The “Course File” will have a complete record of semester‟s contents, for\ninstance:\na. Details of students‟ enrollment / registration in the program. b. Timetable of classes. c. Course Code and contents as per recommendation of respective Board of\nStudies. d. Weekly breakup of classes. e. Details of reschedule of classes, if any. f. Brief points of lecture‟s handouts (no need to attach photocopies of books\nand Web Pages). g. Record of assignments/ quizzes/lab work given to the student with\nevaluation. h. Mid-term Examination‟s question paper. i. Record of terminal exam. j. Students‟ course review report. k. Teacher‟s course review report. 28.3 The Course outline/file of each subject will be made available on the\nUniversity‟s web for students. 28.4 Course File Review Committee:\nThis committee shall be comprised of Chairperson/Head and a Coordinator of the\nconcerned department, In charge of Academics Section (Registrar Office), Director\nAS&RB and Director QEC. This committee will review the Course File process\nfrom time to time. ………………………………………………………………………………………\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 22 of 38\n29. FREEZING OF SEMESTER\n29.1\n“A student can apply for freezing his study up to two semester(s) at a time or\nseparately in 8 semesters program and one semester in 4 semester program as:\na. In normal circumstances on valid reason(s), before commencement of\nMid-term examination subject to approval of the Vice Chancellor on\nrecommendation of the Chairperson/HOD/Principal concerned. b. Before commencement of terminal exam, In case of acute emergency\nsituations like domestic problems (child birth in case of female student, death of\na blood relative or spouse or divorce or imprisonment) and severe accidental\nsituation with documentary/valid proof subject to fulfillment of required class\nattendance and other requirements and approval of the Vice Chancellor on\nrecommendation of the Chairperson/HOD/Principal concerned.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"04314082-33ae-4bf5-8a1e-eb41c0b257c4":{"id_":"04314082-33ae-4bf5-8a1e-eb41c0b257c4","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"fced8329-420f-4980-8015-9ba4d8531c37","metadata":{},"hash":"SNf+mOK4N0cb5/+SP4BCfBQU5oZLOM/i/wYxsKiUShA="},"NEXT":{"nodeId":"38a16c50-b307-4317-9276-011cd474d989","metadata":{},"hash":"7NAuMW4uoyogFpdGFlycxjyENRJyLo4zh1YP/EWi5AI="}},"hash":"dIv/3dK2zVvQM0H0WFqqnl6WCnek6As7YjQTr/R84F0=","text":"[Amended]\nThis was recommended in 6\nth \nAcademic Council and approved by 17\nth \nSyndicate. 29.2 The student will resume the frozen/same semester whenever offered by the\nUniversity/Institute,\n29.3 No freezing in the first semester is allowed. 29.4 Freezing up to two semesters (combined or separately) is allowed to students\nfacing acute domestic problems/valid reasons subject to approval of Vice\nChancellor on the recommendation of the Chairperson/HOD/Principal\nconcerned. 29.5 For frozen semester the student will be required to pay 25% of tuition fee for\neach frozen semester to continue his/her registration with The University of\nHaripur. 29.6 The process of freezing of semester and restoration will be done by the\nAcademic Section of Registrar Office\n……………………………………………………………………………. 30. TEACHER‟S AND COURSE‟S EVALUATION\n30.1 It is mandatory for the Chairperson/ Head of the Department/Principal of the\nconstituent/affiliated college/institute to manage evaluation of every teacher by\nthe students concerned on what they have been taught by their instructor. The\nTeacher evaluation will be carried out by the Quality Enhancement Cell (QEC)\nof the University. 30.2 It must be done in the last two weeks of the semester (without the presence of\nthe course teacher so as to maintain impartiality/transparency). 30.3 This evaluation should be objective and should be shared with the concerned\ncourse teacher for his / her improvement / information. 30.4 Evaluation done by the students will be completely anonymous, i.e. the student\nis not supposed to indicate himself / herself by name, or roll numbers, or\nregistration numbers or by any other means. 30.5 No student will be issued Exam admit Card unless he/ she does not submit the\nteacher evaluation profarma. ……………………………………………………………………………………. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 23 of 38\n31.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"38a16c50-b307-4317-9276-011cd474d989":{"id_":"38a16c50-b307-4317-9276-011cd474d989","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"04314082-33ae-4bf5-8a1e-eb41c0b257c4","metadata":{},"hash":"dIv/3dK2zVvQM0H0WFqqnl6WCnek6As7YjQTr/R84F0="},"NEXT":{"nodeId":"0e693dde-1c78-4dcf-ae80-1535ab89a99b","metadata":{},"hash":"j+q+GavdwqpXlkOjCeOhvWx+/YeAxh0MZM8QRo8E5do="}},"hash":"7NAuMW4uoyogFpdGFlycxjyENRJyLo4zh1YP/EWi5AI=","text":"MERIT CERTIFICATES/MEDALS\n31.1 The Controller of Examinations shall issue a certificate of merit to a student who\nstands first in the degree program on the basis of overall result provided that the\nstudent has obtained CGPA 3.5 or more in the aggregate, has not failed in*, or\nrepeated any course and has completed the course work in normal period as\nprescribed for Master‟s and Bachelor‟s Programs. The recipient for the award of\ncertificate of merit shall also be awarded the Chancellor‟s Gold medal. 31.2 The president‟s gold medal shall be awarded to the student who stands first in\nMaster or Bachelor‟s Program in the respective faculty. The Controller of\nExaminations shall also issue a certificate of merit to such a student. 31.3 If more than one student secures the same CGPA; the position will then be\ndetermined on the basis of percentage of marks obtained. Even if still a tie\nremains, the award will go to the older in age. *Note: First Attempt means that all requirements, i.e. mid-term, assignments, quizzes,\nterm paper, practical and final examination of a subject are completed in time\nand are shown on the first award list submitted by the course instructor to the\nexamination section. ………………………………………………………………………….. 32. UNIVERSITY‟S DISCIPLINE:\nDisciplinary/Criminal cases will be dealt as per “The University of Haripur\nStudents‟ Discipline Rules & Regulations”. 33. CONDUCT OF SEMESTER EXAMINATIONS\n33.1 All mid-term/terminal Semester Examinations of the University shall be held at\nthe concerned department/institute/colleges or where the university‟s\nauthorities decide, on the dates and schedule notified by the\ndepartment/Institutes/college, as approved by the Vice Chancellor and duly\nforwarded to Controller of examinations. 33.2 EXAMINATION SCHEDULE\nThe Departmental examination office of the respective department/institute/\ncollege will notify the examination schedules at least 02 weeks prior to the\ncommencement of the mid-term/terminal examination and forward a copy of the\nschedule to Controller of Examinations, The University of Haripur.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"0e693dde-1c78-4dcf-ae80-1535ab89a99b":{"id_":"0e693dde-1c78-4dcf-ae80-1535ab89a99b","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"38a16c50-b307-4317-9276-011cd474d989","metadata":{},"hash":"7NAuMW4uoyogFpdGFlycxjyENRJyLo4zh1YP/EWi5AI="},"NEXT":{"nodeId":"95bb6db4-777c-4eb8-bb98-7335d5a7abbc","metadata":{},"hash":"Fm2Lp9X1sVdrZlv2byg5nJ5diGPBoIPqRBr/tbJau4w="}},"hash":"j+q+GavdwqpXlkOjCeOhvWx+/YeAxh0MZM8QRo8E5do=","text":"Note: Detailed mechanism of conduct of semester examinations and disposal\nof UFM cases etc is given in “Annexure-A of the Rule 33” (given at the end). ………………………………………………………………………….. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 24 of 38\n34. MAINTENANCE OF EXAMINATION RECORDS\n34.1 The Controller‟s office shall act as Central Record Office of the all examinations\nheld under the University. Controller of Examination will maintain the records of\nthe examinations. The result will be announced by the department and\nController will issue the transcripts. 34.2 The Examination scripts of mid-term and final examination of each semester\nwill be sent to Controller of Examinations who will keep the record in his custody\nsafely. 34.3 The teacher concerned will prepare five copies of the results. He shall retain\none copy with him, display one copy on the notice board and remaining three\ncopies will be handed over to the Departmental Examination Committee. …………………………………………………………………. 35. RESULTS\nThe result of each exam (mid-term and terminal) along with answer books shall\nbe submitted to the Controller of Examinations within 10 days after the\nexamination and it shall be displayed on departmental notice-board and\nuniversity‟s website before submission of the results to Controller of\nExaminations. 36. Disputes\nIn case, a dispute arises on a matter related with the Semester Rules &\nRegulations, and these semester rules & regulations are silent or unclear on a\nmatter, the matter shall be referred to the \"Semester Rules & Regulations\nReview Committee” for resolution and its decision shall be final on the issue. NOTE: \"Annexure-A\" of the Rule 33 of “The University of Haripur Semester\nRules & Regulations (Revised) 2018” is given below:\n=================================================\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"95bb6db4-777c-4eb8-bb98-7335d5a7abbc":{"id_":"95bb6db4-777c-4eb8-bb98-7335d5a7abbc","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"0e693dde-1c78-4dcf-ae80-1535ab89a99b","metadata":{},"hash":"j+q+GavdwqpXlkOjCeOhvWx+/YeAxh0MZM8QRo8E5do="},"NEXT":{"nodeId":"d2ae0428-1cf5-4f59-98ce-9e16a611e276","metadata":{},"hash":"SPzulPG0lUefiSu2KaWspsFIPi/Ec7dvIQ694BFvRoQ="}},"hash":"Fm2Lp9X1sVdrZlv2byg5nJ5diGPBoIPqRBr/tbJau4w=","text":"2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 25 of 38\n\"ANNEXURE- A\" OF RULE 33 OF SEMESTER RULES & REGULATIONS, THE\nUNIVERSITY OF HARIPUR FOR CONDUCT OF SEMESTER EXAMINATIONS. 1. A student shall be eligible to appear in the terminal examinations provided s//he:\na. has been on the roll of the University during the semester;\nb. has registered him/herself for the courses of study, and\nc. has 75% class attendance (for details see rule 15.1 to 15.7). d. has paid all the University dues (including hostel fees, fines, etc. if\napplicable) within notified time. 2. Mid-term examination will be held in the 9\nth \nweek of each semester. The terminal\nexamination will be held at the end of each semester on the dates fixed/notified by\nthe university authorities concerned. The Provost/ Director Admissions/\nAcademics shall announce the approximate dates of examinations at the\nbeginning of the semester according to the Academic Calendar of that particular\nyear. 3. Minimum time allowed for mid-term examination and practical examination in\neach course will be one hour and that for the final examination shall be two hours. 4. In order to pass in the examination of a course, a students must obtain at least\n50% marks. Passing the practical examinations (if applicable) shall be mandatory. 5. After marking the class tests, quizzes, mid-term examination and final\nexamination papers the same maybe shown to the students (where requested in\nwriting) to discuss any reservation of the student. 6. A student may apply for re-totaling of marks within 10 days of the submission of\nresults to Controller of Examinations (C.E) which will be considered by a\ncommittee comprising of the concerned HoD, C.E and in-charge academics\nsection. If during the process of re-totaling the committee observes any serious\nmistake in evaluation of the paper it may refer the case to Grievance Committee\nfor re-evaluation/rechecking. 7.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d2ae0428-1cf5-4f59-98ce-9e16a611e276":{"id_":"d2ae0428-1cf5-4f59-98ce-9e16a611e276","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"95bb6db4-777c-4eb8-bb98-7335d5a7abbc","metadata":{},"hash":"Fm2Lp9X1sVdrZlv2byg5nJ5diGPBoIPqRBr/tbJau4w="},"NEXT":{"nodeId":"105e73b7-2e90-4580-8e0f-3b8366fc6189","metadata":{},"hash":"yphF4ds7RsjkNejnkg2XU1gYHG6eJ/WAKGf3W2yl09k="}},"hash":"SPzulPG0lUefiSu2KaWspsFIPi/Ec7dvIQ694BFvRoQ=","text":"7. The evaluation shall be internal, except for the research/project report/viva voce\nexamination for which an external examiner may be involved. 8. About one week before the final examination, the teacher in each course shall\nsend to the Chairperson / Director of the Department / Institute a statement in\nduplicate, giving the total number of lectures delivered (and practicals conducted)\nby him/her together with the total number of lectures and practicals attended by\neach student. 9. A handicapped/disabled student will be provided writer/amanuensis at the\nexpense of the student concerned on the recommendations of the Chairperson of\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 26 of 38\nthe teaching department. The writer/amanuensis shall be of a lower grade of\neducation than the candidate. He/she would be allowed 45 minutes for solving the\nquestion paper over and above the time stipulated for a question paper. 10. All cases pertaining to UFM shall be dealt with in accordance with the provisions\nmade under the regulations relating to UFM/malpractices in the examinations\nthrough \"Unfair Means Committee\". 11. The defaulters of the University dues are not permitted to sit in the examinations. ====================================\n12. Examination Aids\na. The only items students can take into the examination room are writing material\n(pens, pencils, eraser, and ruler). Writing materials are not permitted to have\nany annotations relevant to the content of the Unit. b. All bags, textbooks and notes etc must be left outside or at the front of the\nroom/Hall. c. Bringing of mobile telephone to the examination room is NOT permitted. The\nmobile telephones will fall in the category of prohibited material in examination. If captured such material by the invigilating staff, its damage/loss will not be the\nresponsibility of the University/examination staff and the same will be kept for\nrecord being a UFM support material. d.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"105e73b7-2e90-4580-8e0f-3b8366fc6189":{"id_":"105e73b7-2e90-4580-8e0f-3b8366fc6189","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d2ae0428-1cf5-4f59-98ce-9e16a611e276","metadata":{},"hash":"SPzulPG0lUefiSu2KaWspsFIPi/Ec7dvIQ694BFvRoQ="},"NEXT":{"nodeId":"5fba039e-1ed4-4afc-8b9a-221f15aeb716","metadata":{},"hash":"WQ5nQhfIPbVygtTPe69hm/mnMXApyAuT3HSbtp4aSWc="}},"hash":"yphF4ds7RsjkNejnkg2XU1gYHG6eJ/WAKGf3W2yl09k=","text":"d. Where a particular examination allows in writing to bring and use specific aids,\nany candidate bringing items that exceed or contradict with the permitted aids\nwill have such items either confiscated for the duration of the examination or, in\nmarginal cases, handed in with their examination scripts. 13. Open Book Examinations. In addition to writing materials, students may take\ntext books, notes, files, or a calculator into the examination room. However,\nLaptops, palm computers, mobile telephone sets and other electronic devices are\nNOT permitted except where allowed in writing by the University authorities. Students enrolled shall be informed from time to time about such items and limits\nduring semester. 14. Panel Of External Examiners\na. A panel/list of external examiners for evaluation of project/research/internship\nreport and to conduct viva-voce examination shall be recommended by the\nrespective Board of Studies. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 27 of 38\nb. The External Examiner shall be appointed by the Dean of the concerned faculty\non the recommendations of the Chairperson/Head of the Department\nconcerned from the approved panel/list. c. The external examiner shall evaluate the project report/dissertation and\nconduct viva-voce examination of the student on the date and time given by the\nChairperson/Head of the department concerned. d. In case the project report is adjudged inadequate by the external examiner,\nhe/she may reject the project report or ask the student to revise/edit the same\nas per approved format. e. The student shall be required to submit revised version of project report/\ndissertation within a period of one month from the date of viva-voce\nexamination. Revised version of the project report/dissertation shall be\nexamined by the Supervisor/Chairperson of the department concerned. f. The result of revised project report as received from the supervisor/Chairperson\nof the department concerned shall be declared and no further extension shall\nbe granted in case the revised version of the project report is rejected, The\nstudent shall have to submit a new project report. g.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"5fba039e-1ed4-4afc-8b9a-221f15aeb716":{"id_":"5fba039e-1ed4-4afc-8b9a-221f15aeb716","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"105e73b7-2e90-4580-8e0f-3b8366fc6189","metadata":{},"hash":"yphF4ds7RsjkNejnkg2XU1gYHG6eJ/WAKGf3W2yl09k="},"NEXT":{"nodeId":"6bad9fab-2f62-42e7-a7c2-311e966fca61","metadata":{},"hash":"OHZ7yQU8jA7rTTyUpPCiISDI2lR2LIzGdUWvYQudaHg="}},"hash":"WQ5nQhfIPbVygtTPe69hm/mnMXApyAuT3HSbtp4aSWc=","text":"g. After the viva-voce examination, the successful student shall submit three\nhardbound copies of the project report to the department for further process for the\ndeclaration of the result. h. The result of the student shall not be declared unless he/she has submitted\nthree copies of the project report to the department on prescribed format. i. Student has to submit his/her project/internship/research report to the controller\nof examination through HOD concerned, in last semester (8th in BS & 4th in\nMA/MSc). If he/she fails to submit in specific time, he/she has to pay fee equal\nto two courses as the case may be (read in conjunction with 24.8). 15. Conduct Of Semester Examinations\nAll mid-term/terminal Semester Examinations of the University, shall be held at\nconcerned Department/institute/colleges, on dates and schedule announced by\nthe Department/ Institute/college concerned, unless otherwise approved by the\nVice Chancellor and duly forwarded to Controller of examinations as per Para 2\nbelow. 16. Examination Schedule\nThe Departmental examination office of the respective department/institute/\ncollege will publish the examination schedules at least 02 weeks prior to the\ncommencement of the mid-term/terminal examination and forward a copy of the\nschedule to Controller of Examinations and Academics Section of The University\nof Haripur. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 28 of 38\n17. Conduct Of Terminal Examination\nThe Chairperson/HOD of concerned Department/Institute will approve the\ndetailing of Faculty/ invigilators as Superintendent/Deputy Superintendent/\ninvigilators for the conduct of mid/terminal examination. These invigilators/ Faculty\nwill ensure the following:\na. Candidates are seated in the examination room according to the seating\nplan prepared by the examination officer/Coordinator of the Department. b. All answer books used in the examination are initialed by them. No other\nanswer books are to be used. c.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"6bad9fab-2f62-42e7-a7c2-311e966fca61":{"id_":"6bad9fab-2f62-42e7-a7c2-311e966fca61","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"5fba039e-1ed4-4afc-8b9a-221f15aeb716","metadata":{},"hash":"WQ5nQhfIPbVygtTPe69hm/mnMXApyAuT3HSbtp4aSWc="},"NEXT":{"nodeId":"2a0fe730-39cb-4275-b0c3-519b96c9135f","metadata":{},"hash":"34Q+MZVkyBcYccLaumjiKUK+RVPlnadtW5WQ9iRD5Hs="}},"hash":"OHZ7yQU8jA7rTTyUpPCiISDI2lR2LIzGdUWvYQudaHg=","text":"No other\nanswer books are to be used. c. Answer books are issued to the invigilators 05 minutes before the\ncommencement of the examination and retrieved at the end of the\nexamination. d. Absentee report, if any, is prepared and forwarded to the departmental\nExamination Officer/Coordinator. 18. Invigilators\nInvigilators are detailed by the departmental examination officer of the\ndepartment/institute after the approval of the Chairperson/HOD. They will report to\nthe Superintendent/Deputy Superintendent 30 minutes before the\ncommencement of examination and will ensure that:\na. The students are seated according to their seating plan. b. The students are warned against the use of unfair means and have been\ndirected to surrender notes, papers or other unauthorized material before the\ncommencement of the examination. c. That no Candidate is allowed to join the examination after 10 minutes in\nmid-term and after 20 minutes of terminal examination after its\ncommencement. d. No Candidate is allowed to leave the examination room before half time of\ncommencement of examination. The visits to „wash rooms‟ will be carefully\ncontrolled. e. The question papers and answer books of candidate detected using unfair\nmeans or assisting another candidate, or is copying from another candidate is\ntaken away and the matter reported to the Superintendent/Deputy\nSuperintendent of examination. The Superintendent records all available\nevidence to be used as written proof later on. f. The candidates write their examination roll/code/detail number on the front\ncover of each additional answer book used. If more than one answer book is\nused, they handed over to the Superintendent or Deputy Superintendent after\nthe examination. ……………………………………………………………………………………………\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 29 of 38\n19. Use of Reference Material During Tests / Exams\nPrior to class test/mid/terminal examinations, the concerned faculty/invigilator\nshall announce such books, notes or other material which can be referred to the\nstudents during the tests/Examinations.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"2a0fe730-39cb-4275-b0c3-519b96c9135f":{"id_":"2a0fe730-39cb-4275-b0c3-519b96c9135f","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"6bad9fab-2f62-42e7-a7c2-311e966fca61","metadata":{},"hash":"OHZ7yQU8jA7rTTyUpPCiISDI2lR2LIzGdUWvYQudaHg="},"NEXT":{"nodeId":"43c88695-4976-49aa-98dd-58ac1c0da63a","metadata":{},"hash":"Ktlv+BjKzlInjiMZmuANC9an5Lp0b2w453nicIROKq4="}},"hash":"34Q+MZVkyBcYccLaumjiKUK+RVPlnadtW5WQ9iRD5Hs=","text":"Candidate will not be in possession of any\nother books, notes, papers or material etc. 20. Question Paper\nAll question papers are set by respective faculty and duly scrutinized, approved\nand conducted in accordance with the University of Haripur policy. As per the spirit\nof Semester system, there will be no choice in attempting the questions. It will also\nbe ensured that the question Papers are balanced with respect to the examination\npolicy and have been prepared to cover the essentials of the whole syllabus\ncompleted by the faculty. In case the teacher who teaches a course is not present\nat the time of the examination, the Chairperson/Head of the Department may\nappoint another teacher for the purpose. 21. Students Responsibility/ Instructions To The Candidates\na. Candidates will report to the Examination Hall/Room, half an hour before the time\nfixed for the examination on the first day and 10 minutes on subsequent days. No\nbooks, notes or documents or other electronic devices like mobile .headphones,\nBluetooth are to be taken in the examination room except those authorized by the\nexaminer. b. All the female candidates will ensure their ears uncovered to avoid the use of\nElectronic devices. c. No candidate shall be allowed to enter the examination center after\ncommencement of the examination. However, in exceptional circumstances, and\nafter applying strict criteria the Centre Superintendent may provisionally allow\ninto the examination hall a candidate who is late up to ten minutes after\ncommencement of the examination, provided the candidate is required to fill in a\nLate Arrival Form giving valid reasons, subject to concurrence of the\ndepartmental examination officer/Coordinator . d. In case the examination starts late, for any reasons to be recorded in writing by\nthe Superintendent and forwarded to the Chairperson/HOD concerned, the\nSuperintendent shall extend the time for the period that has been lost. e. No candidate shall leave the examination hall without the permission of the\nSuperintendent. f. No candidate shall be allowed to leave the examination until half the scheduled\ntime of that examination has passed. In case candidate has to leave the\nexamination hall in emergency situation before this time, for any reasons to be\nrecorded in writing by the Hall Superintendent, he/she shall not be allowed to\ntake the question paper with him/her. The University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"43c88695-4976-49aa-98dd-58ac1c0da63a":{"id_":"43c88695-4976-49aa-98dd-58ac1c0da63a","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"2a0fe730-39cb-4275-b0c3-519b96c9135f","metadata":{},"hash":"34Q+MZVkyBcYccLaumjiKUK+RVPlnadtW5WQ9iRD5Hs="},"NEXT":{"nodeId":"0a4dbeb7-ff61-4565-af53-1dc8b9a61cae","metadata":{},"hash":"tAka8MYKWsDyzcn9d50psi9ED4vp3VRxyhr6rLor8dE="}},"hash":"Ktlv+BjKzlInjiMZmuANC9an5Lp0b2w453nicIROKq4=","text":"The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 30 of 38\ng. No candidate shall be allowed to re-enter the examination hall if he/she leaves\nafter handing over the answer book. h. No candidate shall be allowed to use toilet facilities during the last fifteen minutes\nof the examination except in emergency. i. The candidate shall fill in the details on the title page of the answer book &\ncontinuation sheet. j. Candidate shall not ask for, and shall not be given any explanation about the\nquestion paper except misprint/error. k. Candidate shall not borrow anything like ruler, pen, calculator etc. from other\ncandidates during the examination in any circumstances. l. Candidate shall not talk or disturb other candidates after commencement of the\nexamination. m. Candidate shall not remove a leaf or a part there of, from the answer book\ncontinuation sheet. n. While leaving the examination hall candidate shall handover all answer\nbooks/papers etc to the Supervisory staff. o. Candidate who tries to use unfair means or creates law and order situation during the\nconduct of the examination or otherwise shall be dealt with under “Unfair Means\nRegulations”. p. In case answer book of a candidate is lost after having been received by the Hall\nSuperintendent, and if he/she passes in all other subjects of the examination,\nhe/she may be required to reappear in that one subject of which answer book is\nlost. If, on reappearing, he/she obtains pass marks he/she shall be deemed to\nhave passed the examination. In case of any dispute as to whether a candidate‟s\nanswer book was duly received by the Superintendent or not, the findings of the\ndepartmental examination committee subject to the approval of the Vice\nChancellor, shall be final. 22. Unfair Means / Malpractices\na. Any student found using unfair means or assisting another student during a\ntest/examination or copying from another student would be liable to disciplinary\naction. A student found guilty of such act by the Unfair Means Committee, will be\ndealt with in the light of policy in vogue.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"0a4dbeb7-ff61-4565-af53-1dc8b9a61cae":{"id_":"0a4dbeb7-ff61-4565-af53-1dc8b9a61cae","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"43c88695-4976-49aa-98dd-58ac1c0da63a","metadata":{},"hash":"Ktlv+BjKzlInjiMZmuANC9an5Lp0b2w453nicIROKq4="},"NEXT":{"nodeId":"c6c71679-39dc-4a9d-90d6-74111cb2019a","metadata":{},"hash":"Zo2xsqcbKu1Hn8P/Bo+HYX1mT7MZyD07jOf1bCgzlVQ="}},"hash":"tAka8MYKWsDyzcn9d50psi9ED4vp3VRxyhr6rLor8dE=","text":"Use of unfair means generally covers the\nfollowing:\ni. An attempt to have access to the question paper before the test /\nexaminations. ii. Communicates directly or indirectly with an examiner with the intention of\ngetting to disclose any question or questions set or to be set by him or with the\nobject of influencing him in the award or marks. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 31 of 38\niii. Communicates directly or indirectly with the Superintendent of the examination\ncenter/hall or any other person connected with the supervision of an examination\nfor the purpose of inducing such person to give undue assistance or show undue\nfavor to the candidate. iv. Use / possession of unauthorized reference material during test /\nExamination. whether the material is used or not during the examination. The\npenalty of such cases will be cancellation of Paper(s) or a fine of up-to\nRs.2000/- or both. v. Any form of communication by the Candidate with any one in, or outside the\nexamination room while the test / Examination is in progress. vi. Unauthorized entry into faculty‟s office or that of staff with the intention of\nhaving an access to or tampering with the official record / exam paper etc. vii. Receives assistance from other persons in the examination. viii. Gives assistance to another candidate or allow him/her to copy from his/her\nanswer book in the examination. ix. Removes a leaf or leaves from his answer book. x. Uses abusive or obscene language in his answer book. xi. Smuggles an answer book in or out from the examination hall. xii. Communicates directly or indirectly with any official of the University with the\nintention of obtaining any information connected with the examination, which\nsuch official is bound not to disclose. xiii.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"c6c71679-39dc-4a9d-90d6-74111cb2019a":{"id_":"c6c71679-39dc-4a9d-90d6-74111cb2019a","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"0a4dbeb7-ff61-4565-af53-1dc8b9a61cae","metadata":{},"hash":"tAka8MYKWsDyzcn9d50psi9ED4vp3VRxyhr6rLor8dE="},"NEXT":{"nodeId":"4277ce4d-809c-4c39-ab8c-9d6d96556b56","metadata":{},"hash":"Ju9B+Ow6PKfRTdOuvT2FfUNfWRBCimWBQ2TjPxmrC6U="}},"hash":"Zo2xsqcbKu1Hn8P/Bo+HYX1mT7MZyD07jOf1bCgzlVQ=","text":"xiii. If the guardian or a relative of a candidate communicates or attempts to\ncommunicate directly or indirectly with any of the persons mentioned in paras\n23 (b) & (c) above with the object mentioned therein, such communications\nmay be deemed to have been made by the candidate himself/herself and\nshall be liable for penalty or penalties according to the UFM made. xiv. If a candidate gains admission to the examination or attempts to gain\nadmission by making a false statement in his/her admission form. xv. Producing a false document forging another person‟s signature on a\ndocument. xvi. Allowing another person to impersonate him/her. xvii. If a candidate possesses any firearms or anything capable of being used as\nweapon of offence in or around the examination center/hall/room or assaults\nor threatens to assault a person engaged in the conduct of an examination. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 32 of 38\nxviii. If a person on the rolls of the University abets a candidate in the commission\nof any of the offenses mentioned above, his/her act shall be taken as\nmalpractice. xix. If a person on the rolls of the University obstructs any University official, the\nInspector of any examination center or any person connected with the\nconduct of an examination, in the discharge of such person‟s duties, such\nenrolled student shall be dealt accordingly with UFM penalties. 23. Punishments / Penalties to be awarded to UFM Candidates\na.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"4277ce4d-809c-4c39-ab8c-9d6d96556b56":{"id_":"4277ce4d-809c-4c39-ab8c-9d6d96556b56","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"c6c71679-39dc-4a9d-90d6-74111cb2019a","metadata":{},"hash":"Zo2xsqcbKu1Hn8P/Bo+HYX1mT7MZyD07jOf1bCgzlVQ="},"NEXT":{"nodeId":"2a741730-5739-4061-b92c-877fa7919a69","metadata":{},"hash":"GDgvqH6lrTROtMDfV8pLScDh9Dsx78pM0to7sAgaKfM="}},"hash":"Ju9B+Ow6PKfRTdOuvT2FfUNfWRBCimWBQ2TjPxmrC6U=","text":"23. Punishments / Penalties to be awarded to UFM Candidates\na. Any candidate who, after announcement made by Superintendent, fails to part\nwith or is found to have access to books or notes, papers, bags, pencil cases,\npagers, mobile phones, calculators, palmtop computers, tape recorders or any\nother material or equipment in his/her possession relating to the subject of\nexamination of that paper or detected in giving or receiving assistance, or using\nor attempting to use any other unfair means in connection with the examination,\nshall be expelled by the superintendent from the Examination Room and his/her\nanswer book shall be cancelled and case be reported to the departmental\nexamination officer/Chairperson of the department. b.Any candidate found guilty of copying from any paper, book or notes, or\nallowing any other candidate to copy his/her answer-book, or creating\ndisturbance in the hall by whispering/talking may be disqualified from appearing\nin examination for a period which may extend to two semesters and fine imposed\nup to Rs.1000/- to 5000/- (or both). Decision given by the examination committee\nshall be final. c. Any candidate found guilty of impersonation and is on the rolls of the university/ or\nconstituent institution, he/she shall be disqualified (i.e. both the candidate and the\nimpersonator), shall be liable to expulsion and to be debarred from admission to any\nclass and from appearing at any examination for a period not exceeding five years\nwith a fine of Rs.3000/- to 10,000/- (or both). d. If the impersonator is not on the rolls of the university/ constituent institution but\nholds a degree or diploma conferred or granted by the University, the\nexamination committee shall register a case with the Police, and shall send\nintimation to this effect to the Vice Chancellor/Registrar of the University for\ncancellation of his/her Degree/diploma.*\n* In case of his/her conviction by a court of law for cheating by\nimpersonation will render himself/herself liable to punishment under\nsection 419 P.P.C. to imprisonment which may extend up to seven years,\nor fine, or both. The University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"2a741730-5739-4061-b92c-877fa7919a69":{"id_":"2a741730-5739-4061-b92c-877fa7919a69","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"4277ce4d-809c-4c39-ab8c-9d6d96556b56","metadata":{},"hash":"Ju9B+Ow6PKfRTdOuvT2FfUNfWRBCimWBQ2TjPxmrC6U="},"NEXT":{"nodeId":"b2341306-9c76-4df9-8c5a-609350dca276","metadata":{},"hash":"eo6EBjh8N5sNIn/CyCkReMc+fuSTWvGZKcesS2+3Gy0="}},"hash":"GDgvqH6lrTROtMDfV8pLScDh9Dsx78pM0to7sAgaKfM=","text":"The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 33 of 38\nc. Any candidate found guilty of resorting to physical assault on the Supervisory\nStaff or University Officers or University Officials or any other person deputed in\nthe Examination Centre or other candidates shall be disqualified permanently. d. Any candidate found guilty of possessing firearms, daggers, knives and other\nweapons/hazardous material, which may cause injury, shall be disqualified for a\nperiod of three years to appear in any examination of the University and his\nregular admission from the department/institute be cancelled. In addition a fine as\ndeemed suitable be imposed by the discipline committee. g. Any candidate found guilty of instigating others to stage a walkout or resort to a\npen-down strike shall be liable to expulsion by the Superintendent or the\nDepartmental examination officer or any officer duly authorized by the Vice\nChancellor and shall be disqualified for a period up to three years to appear in\nany examination of the University along with imposition of suitable fine. h. Any candidate found guilty of obtaining admission to the examination on false\nstatement made on his/her document by any means, shall be disqualified to appear\nin that examination. i. Any candidate found guilty of forging another person‟s signatures on his/her\napplication or admission form may be disqualified for a period of one year (02\nsemesters). j. Any candidate found guilty of intentionally spoiling/parting/damaging his/her or\nany other candidate‟s answer book or any other important document/item related\nto the examination, shall be barred from appearing in the examination for two\nconsecutive semesters and a fine of Rs.5000/- to Rs.10000/- be imposed. k. Any candidate found guilty of smuggling/taking answer book/related document\nwith him or stealing of blank answer book/additional sheet/other document, shall\nbe disqualified for a period of three years to appear in any examination of the\nUniversity and his regular admission from the department/institute be cancelled. In addition a fine as deemed suitable will be imposed by the discipline committee. l.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"b2341306-9c76-4df9-8c5a-609350dca276":{"id_":"b2341306-9c76-4df9-8c5a-609350dca276","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"2a741730-5739-4061-b92c-877fa7919a69","metadata":{},"hash":"GDgvqH6lrTROtMDfV8pLScDh9Dsx78pM0to7sAgaKfM="},"NEXT":{"nodeId":"d124d5a3-80fa-4c5f-95b5-392cdbd5ba80","metadata":{},"hash":"6Ucr7bMHqqGDqTjFTuSET19QmWf7nasCqqAEHIc9Cgk="}},"hash":"eo6EBjh8N5sNIn/CyCkReMc+fuSTWvGZKcesS2+3Gy0=","text":"In addition a fine as deemed suitable will be imposed by the discipline committee. l. If a candidate is found guilty of disclosing his/her identity or making peculiar\nmarks or using abusive or obscene language or making an appeal in his/her\nanswer book to the examiner, the answer book of such candidate shall be\ncancelled. m. Any candidate found guilty of influencing or attempting to influence, the\nExaminers or Supervisory Staff or the departmental examination officer and other\nUniversity Staff directly or through his/her relatives or guardians or friends with\nthe objective of gaining benefit in the examination shall be disqualified for the\nexamination. n. Any candidate who refuses to obey the Exam. Superintendent or changes his/her\nseat with another candidate, or changes his/her roll number, shall be expelled\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 34 of 38\nfrom the Examination room and his/her answer book as well as the concerned\npaper shall be cancelled. o. Any candidate, who interchanges his /her answer book (or a part of it) with another\ncandidate, shall be expelled from the examination room and his/her answer book\nshall be cancelled. The entire examination of such candidate(s) shall be cancelled\nand a suitable fine be imposed. p. Any candidate found guilty of tempering fee vouchers by way of depositing less fee\nand enhancing it through forgery on Bank receipt shall be debarred to appear in that\nExamination. q. A Committee shall be constituted by the Vice Chancellor, The University of\nHaripur to deal with unfair means cases (see also Section 24). r. In case of any emergency, the Vice Chancellor may award suitable punishment\nwithout reference to the Committee, in commensuration with the gravity of\noffence, to any candidate or to any student on the rolls of the University/ college,\nwho creates disturbance of any kind during an examination or otherwise\nmisbehaves in or around any Examination Centre/room. s.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"d124d5a3-80fa-4c5f-95b5-392cdbd5ba80":{"id_":"d124d5a3-80fa-4c5f-95b5-392cdbd5ba80","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"b2341306-9c76-4df9-8c5a-609350dca276","metadata":{},"hash":"eo6EBjh8N5sNIn/CyCkReMc+fuSTWvGZKcesS2+3Gy0="},"NEXT":{"nodeId":"e18e6af8-6b49-470e-9ea7-e0f3c4e77536","metadata":{},"hash":"oU89VH3hBT6SIQQ/WL5ovxBwNW5NAbLWr1jXwRz1X3I="}},"hash":"6Ucr7bMHqqGDqTjFTuSET19QmWf7nasCqqAEHIc9Cgk=","text":"s. If a person on the rolls of the University abets a candidate in the commission of\nany of the offenses related to the malpractices/unfair means, he/she shall be\nliable to the same penalty to which the candidate is liable in respect of the offence\nabetted. t. If a person on the rolls of the University obstructs any University official, the\nInspector of any examination center or any person connected with the conduct of\nan examination, in the discharge of such person‟s duties, he/she shall be liable to\nbe expelled from the University for a period not exceeding three years, inclusive\nof the year in which the offence occurred. u. The above penalties (Para 42 & 43) may be imposed in addition to any other\npenalty to which the offender may be liable under any law for the time being in\nforce. v. Act of Supervisory/departmental Staff. If Supervising Staff, Paper Assessor,\nPractical Examiner or any other person employed in connection with an examination\nfails to comply with any instruction issued by the University of Haripur or any of its\nofficers, commits any other irregularity, secures such appointment by supplying\nwrong information through alteration of facts, the department concerned shall report\nthe matter to the Competent Authority for administrative action and/or take any other\nlegal action that may be deemed necessary. 24. Committee Dealing Cases Of Unfair Means In The Examinations\na. The Vice Chancellor shall appoint a Committee for a period of three years to be\nknown as the “Unfair Means Committee” to deal with cases of the alleged use of\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 35 of 38\nunfair means, or other matters affecting the discipline of the students in\nconnection with examinations on hearing from Controller of Examinations. b. The Unfair Means Committee shall comprise of a minimum of three and a\nmaximum of seven members. The Controller of Examinations shall be its\nMember/Secretary. c. Each member shall have a single vote. d. The senior most member shall be the Chairperson of the Committee. e.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"e18e6af8-6b49-470e-9ea7-e0f3c4e77536":{"id_":"e18e6af8-6b49-470e-9ea7-e0f3c4e77536","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"d124d5a3-80fa-4c5f-95b5-392cdbd5ba80","metadata":{},"hash":"6Ucr7bMHqqGDqTjFTuSET19QmWf7nasCqqAEHIc9Cgk="},"NEXT":{"nodeId":"f122dbdf-81a2-4b2c-9fed-b88fa48c7441","metadata":{},"hash":"JJ+Ik78pHbVNGOqOrR6uj3s5JOVlmoCzneCmr38tVFs="}},"hash":"oU89VH3hBT6SIQQ/WL5ovxBwNW5NAbLWr1jXwRz1X3I=","text":"d. The senior most member shall be the Chairperson of the Committee. e. The members of the Committee shall hold office for three years. In case of\nvacancy among the members, the Vice Chancellor shall appoint another person\nwho shall hold office for the remaining period of the term. f. The quorum of the Committee shall be two-third of its total membership. g. In case of difference of opinion among the members, the majority decision shall\nbe regarded as the decision of the Committee. h. If the entire Committee disagrees over an issue, the case shall be referred to the\nVice Chancellor, who shall either decide the case himself or refer it to the Syndicate\nfor its verdict. i. No penalty shall be imposed on a candidate unless he/she has been given a\nreasonable opportunity of showing cause against the action, proposed to be\ntaken against him/her. j. The Unfair Means Committee shall be the Authority to determine the charge of a\nbreach of the rules of examinations and formulate recommendation to the Vice\nChancellor for approval. k. A candidate, aggrieved by the decision of the Unfair Means Committee, may\nbring to the notice of the Vice Chancellor any new facts within seven days of the\nreceipt of such decision. The Vice Chancellor may reconsider the case and give\nhis decision or refer it to the Appellate Committee. l. In case of an emergency, the Vice Chancellor shall be competent to award\nsuitable punishment to a student for breach of any law/rules pertaining to\nexamination. 25. Appellate Committee\nThe Vice Chancellor may appoint an Appellate Committee to hear the appeals\nagainst the decisions of the Unfair Means Committee. The Committee shall\ncomprise of two senior faculty members. The decision of the Appellate Committee\nshall be binding and final and shall not be challengeable in any court of law except\nthe Supreme Court of Pakistan. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 36 of 38\n26.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"f122dbdf-81a2-4b2c-9fed-b88fa48c7441":{"id_":"f122dbdf-81a2-4b2c-9fed-b88fa48c7441","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"e18e6af8-6b49-470e-9ea7-e0f3c4e77536","metadata":{},"hash":"oU89VH3hBT6SIQQ/WL5ovxBwNW5NAbLWr1jXwRz1X3I="},"NEXT":{"nodeId":"533bb187-b6e5-4ecc-a9e3-4c36192a5494","metadata":{},"hash":"FjZYozasPdpAKMAxpbSaLAiIP9EUkh9wUzISsWed9Ng="}},"hash":"JJ+Ik78pHbVNGOqOrR6uj3s5JOVlmoCzneCmr38tVFs=","text":"Destruction/Disposal Of Question Paper/Answer Books/Result Sheet\nThe following policy for destruction of Question Papers/Answer Books/result\nsheet of all types of University exams will be adopted. a. Question paper, if not part of the answer book, will be disposed of after the\nconduct of the examination. However result record will be kept with the\nsecrecy Section of the exam office forever. b. Answer book will be preserved for two years after the completion of the\ndegree program. b. Soft copies of Questions Papers will be retained forever by the concerned\nauthorities. ===========================================\n27. Computation and Approval of Results\nAfter the results are received from each teacher, the departmental examination\nofficer compiles the final results of each class within 10 days after the last day of\nthe examination. The final results show grades obtained in each course of the\nsemester, the Semester GPA and the Cumulative GPA of each student. The result\nsheets also indicate the tentative disposal (probation, dropped out, withdrawal,\nincomplete etc) of students failing to achieve required standard. The final result\nwill be announced by the Controller Examination. 28. Record Of Result\na. Award Lists: The teacher concerned shall prepare five copies of the awards\nfor each semester. He shall retain one copy with him/her and shall send one\ncopy each to;\ni. The Chairperson/HOD of the Department concerned\nii. The Dean of the Faculty concerned. iii. The Departmental examination Officer for preparation/compilation of the\nresult. iv. The Controller of Examinations, The University of Haripur (for future record). b. The final result is recorded on the provisional semester transcript of each\nstudent. The departmental examination officer of respective department/\ninstitute prepares four copies of individual student semester transcript. The\noriginal copy is sent to the Controller of Examination, The University of\nHaripur, the record copy to the provost Office for record, the third copy to the\nstudents. The fourth copy is retained in the student‟s personal file at the\ndepartment/institute. The complete semester result of each course is sent to\nExam Department of the University for resulting and formal notification.*\n\nThe University of Haripur Semester Rules and Regulations\n(Revised Sep.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"533bb187-b6e5-4ecc-a9e3-4c36192a5494":{"id_":"533bb187-b6e5-4ecc-a9e3-4c36192a5494","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"f122dbdf-81a2-4b2c-9fed-b88fa48c7441","metadata":{},"hash":"JJ+Ik78pHbVNGOqOrR6uj3s5JOVlmoCzneCmr38tVFs="},"NEXT":{"nodeId":"8a3b8fb9-cb1f-4276-a652-642ec628c28a","metadata":{},"hash":"K6JAQYtSe7PQJCO3V7kxnzXWOZnPPfaKTjF/IAGUcOU="}},"hash":"FjZYozasPdpAKMAxpbSaLAiIP9EUkh9wUzISsWed9Ng=","text":"2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 37 of 38\n29. Issue Of Academic Transcript/Detail Marks Sheet\na. A student desirous of obtaining Academic Transcript/detailed Mark Sheet\nmay apply to the Chairperson/HOD along with the prescribed fee as per the\npolicy issued on the subject by the Controller of Examination, The University\nof Haripur. b. Conduct of Project/Research/Internship Report Evaluation And Viva Voce. At the end of his course of study, the candidate shall present three copies of\nthe Project/Research/Internship Report for examination. The candidate shall\nbe required to attend an oral examination on his/her\nProject/Research/Internship Report. c. Appointment Of Examiners\nOn the recommendation of the Chairperson the Dean of Faculty concerned shall\nappoint two examiners for the Project/Research/Internship Report. Names of the\nexaminers shall be duly endorsed by the Controller of Examinations. One of\nwhom shall be the Supervisor. The examiner shall examine the\nthesis/dissertation and send the result through the Chairperson/HOD to the\nController of Examinations, The University of Haripur. d. Project/Research/Internship Report examination\nAn undergraduate student will be required to qualify the examination by\nobtaining GPA 2. If he fails, the Project/research/Internship Report may be\nrejected without the option of resubmission of the Project/Research/Internship\nReport. i. If the examiners find that the Project/Research/Internship Report need not\nbe altogether rejected the candidate may be permitted to revise and submit\nhis Project/Research/Internship Report for a new examination within two\nmonths. ii. If there is a difference of opinion amongst the examiners about the\nadequacy of the Project Report the Dean of Faculty concerned on the\nrecommendation of the Chairperson/HOD shall appoint a third examiner. If\nthe Project/Research/Internship Report is adjudged adequate, a viva-voce\nexamination will be held for it. iii.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"8a3b8fb9-cb1f-4276-a652-642ec628c28a":{"id_":"8a3b8fb9-cb1f-4276-a652-642ec628c28a","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/Semester-Rules-Regulations-BS-Programs-UOH.pdf","metadata":{},"hash":"TD79tvfkl+XtUlpaJD/K/MBRgWeznM3j0SbmIadlMIw="},"PREVIOUS":{"nodeId":"533bb187-b6e5-4ecc-a9e3-4c36192a5494","metadata":{},"hash":"FjZYozasPdpAKMAxpbSaLAiIP9EUkh9wUzISsWed9Ng="}},"hash":"K6JAQYtSe7PQJCO3V7kxnzXWOZnPPfaKTjF/IAGUcOU=","text":"iii. Only one chance of resubmission shall be allowed to the student and if the\nrevised Project/Research/Internship Report is not approved under\naforesaid procedure the Project/Research/Internship Report shall be finally\nrejected. The University of Haripur Semester Rules and Regulations\n(Revised Sep. 2019)\n(For Undergraduate Degree Programs)\nRevised & approved by 17\nth \nSyndicate held on 12/9/2019 \nPage 38 of 38\n30. Viva-Voce Examination\na. The viva voce examination shall be conducted by the\nProject/Research/Internship Report examiners under the supervision of the\nChairperson/HOD. b. If the candidate passes in the viva-voce examination, he/she will be\nawarded the degree. However, if the candidate fails in the viva-voce\nexamination he /she will be permitted to re-appear once more in the\nviva-voce examination within two months. Failure for the second time may\nmean failure in the examination altogether. c. If the candidate passes the aforesaid viva-voce examination his/her result\nmay be declared and the candidate may be awarded the degree. 31. The grading of the report and viva-voce examination shall be included in the\ncumulative Grade Point Average (CGPA) of the result.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"}},"type":"simple_dict"}}}